[{"url": "https://en.wikipedia.org/wiki/Tom_Brady", "text": "        CentralNotice    Tom Brady  From Wikipedia, the free encyclopedia  This is the latest accepted revision, reviewed on 26 October 2015.          Jump to:     navigation,      search  For other people named Tom Brady, see Tom Brady (disambiguation).  Tom Brady   Brady in 2011    No. 12   New England Patriots   Position: Quarterback   Personal information   Date of birth: (1977-08-03) August 3, 1977 (age38)   Place of birth: San Mateo, California   Height: 6ft 4in (1.93m)   Weight: 225lb (102kg)   Career information   High school: San Mateo (CA) Jun  pero Serra   College: Michigan   NFL draft: 2000/ Round:6/ Pick:199   Career history     New England Patriots (2000   present)     Roster status: Active   Career highlights and awards     NFL   4   Super Bowl Champion (XXXVI, XXXVIII, XXXIX, XLIX) 3   Super Bowl MVP (XXXVI, XXXVIII, XLIX) 2   NFL MVP (2007, 2010) 10   Pro Bowl (2001, 2004, 2005, 2007, 2009, 2010, 2011, 2012, 2013, 2014) 2   First-team All-Pro (2007, 2010) Second-team All-Pro (2005) 6   AFC Champion (2001, 2003, 2004, 2007, 2011, 2014) 3   NFL passing touchdowns leader (2002, 2007, 2010) 2   NFL passing yards leader (2005, 2007) Sports Illustrated Sportsman of the Year (2005) Sporting News Sportsman of the Year (2004, 2007) AP Male Athlete of the Year (2007) 2   NFL Offensive Player of the Year (2007, 2010) 3   AFC Offensive Player of the Year (2007, 2010, 2011) AP NFL Comeback Player of the Year (2009) PFWA NFL Comeback Player of the Year (2009) Bert Bell Award (2007) New England Patriots all-time leader (passing touchdowns, passing yards, pass completions, pass attempts, career wins, games played) Most career wins with single team (164) NFL 2000s All-Decade Team   College   2   Big Ten Champion Rose Bowl (1998) National Champion (1997) Citrus Bowl (1999) Orange Bowl (2000)     Career NFL statistics as of Week 7, 2015   Passing attempts: 7,419   Passing completions: 4,724   Percentage: 63.7   TD INT: 408   144   Passing yards: 55,312   Passer rating: 96.5   Stats at NFL.com   Thomas Edward Patrick \"Tom\" Brady, Jr. (born August 3, 1977), nicknamed Tom Terrific,[1][2][3] is an American football quarterback for the New England Patriots of the National Football League (NFL). After playing college football for the University of Michigan, Tom Brady was drafted by the Patriots in the sixth round of the 2000 NFL draft. In Brady's 13 full seasons as a starter (he missed nearly all of 2008 with a torn ACL),[4][5] the Patriots have earned six trips to the Super Bowl, winning four. Brady has won three Super Bowl MVP awards, two league MVP awards (2007, 2010), has been selected to ten Pro Bowls, and has led the Patriots to more division titles than any other quarterback in NFL history, with twelve. Brady is fifth on the all-time list for career passing yards and fifth for career touchdown passes. His career postseason record is 21   8; his playoff win total is the most in NFL history. He helped set the record for the longest consecutive win streak in NFL history with 21 straight wins over two seasons (2003   2004). He also set the record for most consecutive playoff wins with 10, and in 2007 led the Patriots to the first undefeated regular season since the institution of the 16-game schedule. He has thrown for more passing yards and touchdowns than any quarterback in NFL postseason history, and has the sixth highest career passer rating of all time (95.9) among quarterbacks with at least 1,500 career passing attempts. Tom Brady is considered among the greatest quarterbacks of all time.[6] He and Joe Montana are the only two players in NFL history to win the NFL Most Valuable Player and Super Bowl MVP awards multiple times. Brady is the only quarterback to lead his team to six Super Bowls, and holds the record for the most total Super Bowl touchdown passes.[7] He was named the NFL MVP in 2007 and 2010 (becoming the first player since 1986 to be unanimously chosen as MVP) as well as the 2007 Male Athlete of the Year by the Associated Press, the first NFL player to be so honored since 1990. After the 2010 season, Brady was ranked as the top player in the NFL Top 100, a poll of league players. He also became the first quarterback to throw for 50 or more touchdowns in a season. In 2010, he set the NFL record for consecutive passes without an interception (358),[8] and broke his own record for the highest season touchdown to interception ratio, among players who have started a full season, at 9:1. Brady and Patriots head coach Bill Belichick have combined to form the most successful quarterback-coach tandem in NFL history, winning over 163 regular season games and 21 postseason games together, as well as appearing in six Super Bowls together, all NFL records.[9]    Contents   1 Early years 2 College career 3 Professional career  3.1 Overview 3.2 2000 season 3.3 2001 season  3.3.1 2001 postseason   3.4 2002 season 3.5 2003 season  3.5.1 2003 postseason   3.6 2004 season  3.6.1 2004 postseason   3.7 2005 season  3.7.1 2005 postseason   3.8 2006 season  3.8.1 2006 postseason   3.9 2007 season  3.9.1 2007 postseason   3.10 2008 season 3.11 2009 season  3.11.1 2009 postseason   3.12 2010 season  3.12.1 2010 postseason   3.13 2011 season  3.13.1 2011 postseason   3.14 2012 season  3.14.1 2012 postseason 3.14.2 2013 season 3.14.3 2013 postseason   3.15 2014 season  3.15.1 2014 postseason 3.15.2 Deflategate   3.16 2015 season   4 Professional statistics  4.1 Regular season 4.2 Playoffs 4.3 Super Bowl   5 NFL records  5.1 NFL (career) 5.2 Playoffs (career) 5.3 Super Bowl (career)   6 Personal life 7 See also 8 References 9 Further reading 10 External links    Early years Tom Brady was born in San Mateo, California, the only son and fourth child of Galynn Patricia (n  e Johnson) and Thomas Brady, Sr.[10] He has three older sisters named Nancy, Julie, and Maureen.[11] He was raised Catholic, and is of Irish descent on his father's side and of Polish, Norwegian, and Swedish descent on his mother's side.[12][13][14][15][16] Brady regularly attended 49ers games at Candlestick Park in the 1980s, where he became a fan of quarterback Joe Montana; since then, Brady has mentioned Montana as one of his inspirations and an idol.[17] One of the games Brady attended was the 1981 NFC Championship against the Dallas Cowboys, in which Montana threw The Catch to Dwight Clark, with Brady only being four years old at the time.[18] Brady attended football camp at the College of San Mateo as a kid, where he learned to throw the football from camp counselor and quarterback Tony Graziani.[19] Brady grew up as a Los Angeles Lakers and Boston Celtics fan.[20] Brady attended Jun  pero Serra High School in San Mateo, California, graduating in 1995 at St. Mary's Cathedral.[21] While at Serra, Brady played football, basketball, and baseball. He played against Bellarmine College Preparatory rival Pat Burrell in both football and baseball. Brady was drafted as a catcher in the 18th round of the 1995 MLB Draft by the Montreal Expos.[22] During the summer of 1998 and 1999, Brady was an intern at Merrill Lynch.[23] In 2004, Brady was inducted into the school's Athletic Hall of Fame.[citation needed] When Brady revisited two weeks after Super Bowl XLVI in 2012, it was announced by school administration that the school had named the football stadium Brady Family Stadium.[24] College career Brady played college football for, and graduated from, the University of Michigan.[25][26] He was a backup quarterback for his first two years, while teammate and future NFL quarterback Brian Griese led the 1997 Wolverines to an undefeated season capped by a victory in the Rose Bowl and a share of the national championship. When he enrolled at Michigan, Brady was seventh on the depth chart and had an intense struggle to get some playing time. At one point, Brady hired a sports psychologist to help him cope with frustration and anxiety and even considered transferring to California.[27][28] He worked closely with assistant athletic director Greg Harden, who met with Brady every week to build his confidence and maximize his performance on the field.[29] Brady told 60 Minutes in 2014: \"\"He will always be somebody I rely on for sound advice and mentorship. He has helped me with my own personal struggles in both athletics and in life. Greg really pushed me in a direction that I wasn't sure I could go.\" [30] Brady battled for the starting job with Drew Henson,[26] ultimately starting every game in the 1998 and 1999 seasons under Michigan head coach Lloyd Carr. During his first full year as starter, he set Michigan records for most pass attempts and completions in a season (214).[31] Brady was All-Big Ten honorable mention both seasons and team captain his senior year. The Wolverines won 20 of 25 games when he started, and he set a school record for completions in a 31-16 loss against Ohio State in 1998, a season in which Michigan shared the Big Ten Conference title. Brady capped that season with a win over Arkansas in the Citrus Bowl.[32] In the 1999 season, Brady had to once again hold off Henson for the starting job. The two platooned over the season's first seven games, with Brady playing the first quarter, Henson the second and Carr then deciding upon a quarterback for the second half. The 1999 Michigan Wolverines started off 5-0, including a 26-22 win over Notre Dame and a road win against eventual powerhouse Wisconsin. Against Michigan State, Brady was not chosen to play the second half but was reinserted into the game with Michigan down 17; he nearly led Michigan all the way back before losing 34-31. After a 300-yard passing game the following week, Carr went exclusively with Brady for the remainder of the season. Brady went on to lead Michigan to multiple 4th-quarter comebacks, including a remarkable 31-27 win against Penn State, and leading them out of a close game against Indiana, 34-31, heading into the regular season's final game, winners of three straight, earning him the moniker of \"Comeback Kid\". Brady concluded the regular season against Michigan's rival, Ohio State, in a dramatic game, with a trip to the Orange Bowl on the line. With five minutes left, tied 17-17, Brady led Michigan to the winning score. He then led Michigan to an overtime win in the Orange Bowl over Alabama, throwing for 369 yards, four touchdowns, leading the team back from a pair of 14-point deficits in regulation (14-0 in the first half, and 28-14 in the second). He threw the game-winning score on a bootleg to tight end Shawn Thompson. Michigan then won when Alabama missed an extra point following its own touchdown. Professional career Overview Brady was a lightly regarded prospect coming out of college, and was selected by the New England Patriots in the sixth round of 2000 NFL draft. He has subsequently played his entire professional career with the Patriots and has enjoyed a distinguished and decorated career including four Super Bowl wins, three Super Bowl MVPs and two League MVPs. Brady is considered among the greatest quarterbacks of all time.[6] In addition to his other accolades he has been named to the Pro Bowl ten times, and led the league in passing three times. He holds numerous NFL post-season passing records, and has more post-season wins than any other quarterback. With Brady playing quarterback, the Patriots have never had a losing season, have won 12 division titles, and played in a remarkable nine AFC Championship Games from 2001 to 2014 (including four in a row from 2011 to 2014), winning six of them. Brady took over as the starting quarterback in his second season after an injury to Drew Bledsoe, and eventually led the Patriots to victory in Super Bowl XXXVI. The Patriots would miss the playoffs the following season, but would then win back-to-back titles in Brady's fourth and fifth years as a pro. Although Brady and Patriots continued to be highly successful, he did not return to the Super Bowl until the 2007 season. In that season Brady set an NFL record for touchdown passes, won his first League MVP, and led the Patriots to a 16-0 regular season record. However, the Patriots were upset by the New York Giants in spectacular fashion in Super Bowl XLII. Brady missed virtually the entire following season due to a catastrophic knee injury in his first game. Brady won the NFL comeback player of the year in the 2009 season, and he and the Patriots continued in that and subsequent seasons to turn in strong performances, winning his second League MVP in 2010. However Brady did not return to the Super Bowl until the 2011 season where once again Brady and the Patriots were upset by the New York Giants. Brady then made his sixth and most recent trip to the Super Bowl after the 2014 season (Brady's 15th as a pro) where Brady led a memorable fourth quarter comeback over the defending champion Seattle Seahawks for his fourth Super Bowl win, and was named Super Bowl MVP for the third time. 2000 season Brady was selected with pick #199, a compensatory pick, in the sixth round of the 2000 NFL draft.[33] According to Michael Holley's book Patriot Reign, the Patriots were considering Brady and Tim Rattay, both of whom had received positive reviews from then-quarterbacks coach Dick Rehbein.[34] Ultimately, the Patriots front office chose Brady. Considering his later achievements, many analysts have called Brady the best NFL draft pick of all time.[35][36][37][38] Brady started the season as the fourth string quarterback, behind starter Drew Bledsoe and backups John Friesz and Michael Bishop; by season's end, he was number two on the depth chart behind Bledsoe.[39] During his rookie season, he was 1-of-3 passing, for six yards.[40] 2001 season The Patriots opened the season with a 23   17 loss at Cincinnati, with Bledsoe as the starting quarterback.[40] Their second game, and home opener, on September 23, was against their AFC East rival, the New York Jets. Bledsoe was again the starter, when in the fourth quarter he suffered internal bleeding after a hit from Jets linebacker Mo Lewis. Bledsoe returned for the next series, but was replaced with Brady for the Patriots' final series of the game. New York would hold on to win, 10   3, and the Patriots fell to 0   2 on the season.[41] Brady was named the starter for the season's third game, against the Indianapolis Colts. In his first two games as starter, Brady posted unspectacular passer ratings of 79.6 and 58.7, respectively, in a 44   13 victory over the Colts (in their last season in the AFC East) and a 30   10 loss to the Miami Dolphins.[42] In the Pats' fifth game, Brady began to find his stride. Trailing the visiting San Diego Chargers 26   16 in the fourth quarter, Brady led the Patriots on two scoring drives to force overtime, and another in overtime to set up a winning field goal. Brady finished the game with 33 pass completions on 54 attempts, for 364 yards, and two touchdowns.[43] The following week, Brady again played well during the rematch at Indianapolis, with a passer rating of 148.3 in a 38   17 win.[44] The Patriots went on to win eleven of the fourteen games Brady started, and six straight to finish the regular season, winning the AFC East and entering the 2001   02 NFL playoffs with a first-round bye. Brady finished with 2,843 passing yards and 18 touchdowns and earned an invitation to the 2002 Pro Bowl.[40][45] 2001 postseason In Brady's first playoff game, against the Oakland Raiders, he threw for 312 yards and led the Patriots back from a ten-point fourth-quarter deficit to send the game to overtime, where they won on an Adam Vinatieri field goal. A controversial play in that game came when, trailing by three in the fourth quarter, Brady lost control of the ball after being hit by Raiders' cornerback, and fellow Wolverine Charles Woodson. Oakland initially recovered the ball, but, citing the \"tuck rule,\" which states that any forward throwing motion by a quarterback begins a pass even if the quarterback loses possession of the ball as he is attempting to tuck it back toward his body, referee Walt Coleman overturned the call on instant replay, ruling it an incomplete pass rather than a fumble.[46] In the AFC Championship Game against the Pittsburgh Steelers, Brady injured his knee, and was relieved by Bledsoe.[47] The Patriots won the game and were immediately instituted by Las Vegas oddsmakers as 14-point underdogs against the NFC champion St. Louis Rams in Super Bowl XXXVI.[48] The score was tied with 1:21 left in the Super Bowl and the Patriots were at their own 17   with no timeouts   when sportscaster and Super Bowl-winning coach John Madden said he thought the Patriots should run out the clock and try to win the game in overtime.[49] Instead, Brady drove the Patriots' offense down the field to the Rams 31 before spiking the ball with seven seconds left. The Patriots won the game by a score of 20   17, after Adam Vinatieri made another field goal as time expired. Brady was named MVP of Super Bowl XXXVI while throwing for 145 yards, one touchdown, and no interceptions, becoming the then-youngest quarterback to ever win a Super Bowl.[50] A possible quarterback controversy was averted when Bledsoe was traded to the Buffalo Bills in the offseason, cementing Brady's status as the starter. 2002 season Brady and the Patriots finished the year at 9   7, tied with the New York Jets and Miami Dolphins for the best record in the division; however, the Jets won the division on the third tiebreaker, and the Patriots missed the playoffs.[51] Although posting a career-low single-season rating of 85.7, Brady threw for a league-leading 28 touchdown passes and 921 more yards than in 2001, though his fourteen interceptions would turn out to be a career high.[42] However, Brady played much of the second half of the season with a shoulder injury, and New England head coach Bill Belichick has since indicated that if the Patriots had made the playoffs, Brady would not have been able to play in the first game due to that injury. 2003 season In the 2003 NFL season, after a 2   2 start, Brady led the Patriots to twelve consecutive victories to finish the season, thus winning the AFC East.[52] Statistically, Brady's strongest game of the season was against Buffalo, when he achieved a season-high quarterback rating of 122.9.[42] Brady finished with 3,620 passing yards and 23 touchdowns,[40] and was third in NFL MVP voting to co-winners Peyton Manning and Steve McNair.[53] 2003 postseason In the first two rounds of the playoffs, the Patriots defeated the Tennessee Titans and Indianapolis Colts. On February 1, 2004, Brady led the Patriots to a 32   29 victory over the NFC champion Carolina Panthers in Super Bowl XXXVIII and was named Super Bowl MVP for the second time. During the game, Brady threw for 354 yards with three touchdowns and set the record for most completions by a QB in a Super Bowl (32). With 1:08 left in the fourth quarter and the score tied 29   29, Brady engineered a drive to put the Patriots in position for the game-winning field goal.[54] 2004 season     Brady during Super Bowl XXXIX   During the 2004 season, Brady helped the Patriots set an NFL record with 21 straight wins dating from the previous year, an accomplishment honored in the Pro Football Hall of Fame (though for official records, the NFL considers it an 18-game regular season winning streak; it does not count playoff games).[55] New England's 14   2 record equalled that of their 2003 season, as well as tied the best regular-season record ever for a defending champion.[56] The Patriots also won the AFC East divisional title for the third time in four years. Brady threw for 3,692 yards and 28 touchdowns, with a 92.6 passer rating, and was voted to his second Pro Bowl.[40] 2004 postseason In the AFC playoffs, Brady led the Patriots to victories over the Indianapolis Colts and the Pittsburgh Steelers.[57] Brady played his best game of the year in Pittsburgh despite requiring intravenous treatment the previous night when he ran a temperature of 103 degrees.[58] Against the NFL's best defensive team,[57] he recorded a quarterback passer rating of 130.5, his highest of the season.[42] On February 6, 2005, the Patriots narrowly defeated the Philadelphia Eagles by a score of 24   21, to win Super Bowl XXXIX. Brady threw for 236 yards and two touchdowns[59] while capturing the Patriots' third championship in four years. 2005 season During the 2005 season, the Patriots were forced to rely more on Brady's passing, due to injuries suffered by running backs Corey Dillon, Patrick Pass, and Kevin Faulk.[60][61] Brady also had to adjust to a new center and a new running back: Heath Evans. The results were positive; Brady finished first in the league with 4,110 passing yards and third in the league with 26 touchdowns.[40] At 92.3, his 2005 passer rating was the second-highest of his career at the time, although he equalled his career high for interceptions with fourteen.[42] He rushed for 89 yards and fumbled a career-low four times.[42] He and the Patriots finished with a 10   6 record, winning their third straight AFC East title.[62] 2005 postseason In the playoffs, Brady led the Patriots to a 28   3 victory over the Jacksonville Jaguars in the wild card round; however, on January 14, 2006, the Patriots lost 27   13 to the Denver Broncos at INVESCO Field. Brady threw for 341 yards in the game with one touchdown and two interceptions, in the first playoff loss of his career.[63] After the season's end, it was revealed that Brady had been playing with a sports hernia since December. Linebacker Willie McGinest commented on it and said he knew, but Brady continued on playing.[64]     Brady on the sideline with teammates Randy Moss and Jabar Gaffney, after throwing for his record-breaking 50th passing touchdown of the season at Giants Stadium.   2006 season Brady led the Patriots to a 12   4 record and the fourth seed in the AFC playoffs.[65] In the regular season, Brady threw for 3,529 yards and 24 touchdowns.[40] He was not among the players initially selected to the Pro Bowl,[66] although he was offered an injury-replacement selection when Philip Rivers was forced to withdraw (which he declined).[67] 2006 postseason In the postseason, the Patriots first hosted their division rivals, the New York Jets, in the wild-card round. The Patriots defeated the Jets 37   16, as Brady went 22   34 for 212 yards and two TDs.[68] In the divisional round, the Patriots traveled to San Diego to take on the Chargers. This was Brady's first playoff game in his home state of California. Brady and the Patriots struggled against the Chargers, whom many had picked as favorites to win Super Bowl XLI.[69] With eight minutes left in the fourth quarter and the Patriots down by eight points, Brady and the Patriots started a key drive that would ultimately decide the game. After a 49-yard pass play to Reche Caldwell, a Stephen Gostkowski field goal gave the Patriots a 24   21 win.[70] In the AFC championship, the Patriots faced the Indianapolis Colts. The Patriots and Colts had faced each other twice in the previous three postseasons at Foxborough; this game, however, was played at Indianapolis. The Patriots led at halftime, 21   6; however, the Colts staged a comeback, culminating in a last minute interception thrown by Brady, and the Patriots losing the game to the Colts, 34   38.[71] 2007 season Playing with a dramatically overhauled receiver corps   in the 2007 offseason, the Patriots acquired wide receivers Dont   Stallworth, Wes Welker, Kelley Washington and Randy Moss; tight end Kyle Brady; and running back Sammy Morris   Brady enjoyed what some sports writers have described as the best season ever by a quarterback.[72][73] The average score of a 2007 Patriots regular season game would be 37   17 by the end of the year.[74] Brady led the Patriots to the first 16   0 regular season record in league history, outscoring opponents by more than a 2-to-1 margin, but also attained numerous career, franchise, and NFL records and milestones in the process. While away at Dallas, he had a career-high five passing touchdowns in a 48   27 win. The win tied him with Roger Staubach for the most wins ever by a starting quarterback in his first 100 regular-season games, with 76.[75] The next week, in part of a 49   28 win at Miami, he had yet another record day, with six passing touchdowns, setting a franchise record. He also had the first perfect passer rating of his career.[76] Two weeks laters, as part of a come-from-behind 24   20 victory at Indianapolis, he threw for another three touchdowns, the ninth consecutive game in which he had done so, breaking Peyton Manning's NFL record of eight.[77] During the last game of the year, Brady threw two touchdown passes; his second touchdown was his 50th, breaking Peyton Manning's 2004 record of 49.[citation needed]     Brady in December 2007   Brady finished the season with 4,806 passing yards, 50 touchdown passes, and only 8 interceptions. It was unanimously voted the greatest passing season of all time by ESPN in 2013. His 50:8 touchdown to interception ratio was a then NFL record (it currently[when?] is the third best). He became the first quarterback to pass for 50 touchdowns in a season and his 117.2 passer rating is currently[when?] the fourth highest in a single season. His 8.7% touchdown passing percentage is currently[when?] the third highest ever in a season. He led the Patriots to becoming the first team to ever go undefeated in the regular season since the 16 game schedule was enforced and directed an offense that scored a then NFL record 589 points and 75 total touchdowns. Those records stood until they were eclipsed by the 2013 Broncos. The team's 50 total touchdown passes is the fourth most ever in a season. For his efforts, Brady was named the Most Valuable Player of this season, as well as Offensive Player of the Year. He was also honored by the Associated Press as their Male Athlete of the Year, the first time an NFL player has been so honored since Joe Montana won the award in 1990.[78] 2007 postseason In the Patriots' first playoff game, an AFC Divisional game against Jacksonville, Brady began the game with an NFL postseason record sixteen consecutive completed passes, and finished the game with 26 completions in 28 attempts, a completion rate of 92.9%. That mark is the highest single-game completion percentage (for passers with at least 20 attempts) in NFL history, regular season or postseason.[79] With the win, the Patriots matched the Dolphins as the only team to win 17 consecutive games in one season. Statistically, Brady did not fare as well in the AFC Championship Game against the San Diego Chargers, throwing three interceptions (including his first interception in the red zone since the playoff loss to Denver). Nevertheless, the Patriots won their 18th game of the season, 21   12, to advance to the Super Bowl for the fourth time in seven seasons. Brady, with the 100th win of his career, also set an NFL record for the fewest games needed by a starting quarterback to do so: his 100   26 record is sixteen games better than Joe Montana's.[80] In Super Bowl XLII, Brady was pressured heavily and sacked five times. The Patriots did manage to take the lead with a Brady touchdown to Moss with less than three minutes remaining in the fourth quarter, but the Giants were able to score a last-minute touchdown to upset the Patriots 17   14, taking away what would have been the first perfect season since the NFL expanded its regular season to 16 games.     Brady in action against the Washington Redskins on August 28, 2009.   2008 season Brady did not play in any games during the 2008 preseason or in the 2008 Pro Bowl due to two different foot injuries.[81][82] In the Patriots' 2008 season opener against the Kansas City Chiefs at Gillette Stadium, Brady's left knee was seriously injured midway through the first quarter on a hit by Chiefs safety Bernard Pollard; he left the game and did not return. The team later confirmed that Brady would require surgery, and it would prematurely end his 2008 season.[83] Brady tore both his anterior cruciate ligament and medial collateral ligament.[84] The injury ended Brady's streak of 111 consecutive starts (seventh in the list of most consecutive starts by an NFL quarterback, behind Brett Favre, Peyton Manning, Ron Jaworski, and Joe Flacco).[85] Dr. Neal ElAttrache performed the anterior cruciate ligament reconstruction at the Los Angeles Kerlan-Jobe Orthopaedic Clinic October 6, using Brady's patellar tendon graft to replace the torn ligament, and also repaired his medial collateral ligament, through a separate incision in his left knee.[86] An infection in the wound resulted in further debridement surgery several times since the original procedure. Brady received IV antibiotics for this infection which, at the time, threatened to delay his rehab.[87][88] 2009 season     Tom Brady in Landover, Maryland, on August 28, 2009, during warmups in a preseason game against the Washington Redskins.   In his first game back from an injury, Brady threw for 378 yards and two touchdowns in the 2009 season opener against the Buffalo Bills. In the final minutes of the game, the Patriots were down 24   13 before Brady and Benjamin Watson connected on two straight touchdowns to lead the Patriots to a 25   24 win. Brady was named the AFC Offensive Player of the Week for the 13th time in his career for his performance.[89] On October 18, 2009, in an early season snowstorm, Brady set an NFL record against the Tennessee Titans for most touchdowns in a single quarter, throwing five in the second quarter. Brady finished the game with six touchdowns, tying his career best, and 380 yards, completing 29 of 34 attempts, finishing with a nearly perfect passer rating of 152.8.[90] The Patriots' 59   0 victory over the Titans tied the record for the largest margin of victory since the 1970 AFL-NFL merger,[91] and set a record for largest halftime lead in NFL history (they led 45   0). Brady would finish the 2009 regular season with 4,398 yards passing and 28 touchdowns for a 96.2 rating,[40] despite a broken right ring finger and three fractured ribs, all which were suffered over the course of the season.[92] He was selected as a reserve to the 2010 Pro Bowl and named the 2009 NFL Comeback Player of the Year.[93] 2009 postseason Brady ended the 2009 season throwing 3 interceptions in a Wild Card playoff loss to the Baltimore Ravens, 33   14, his first career home playoff loss, and the first playoff loss at home by a New England Patriots quarterback since 1978.[94] 2010 season On September 10, 2010, Brady signed a four-year, $72 million contract extension making him the highest-paid player in the NFL. The extension included $48.5 million in guaranteed money.[95] Brady became the quickest to achieve 100 regular season wins by helping his team defeat the Miami Dolphins 41   14 on October 4, 2010.[96] On November 21, 2010, Brady tied Brett Favre's record of winning 25 consecutive regular-season home starts, in a 31   28 win over the Indianapolis Colts.[97] Brady's last regular-season loss at home was on November 12, 2006, a 17   14 loss to the New York Jets.[98] On December 6, 2010, Brady set an NFL record by winning 26 consecutive regular-season home starts, in a 45   3 victory over the New York Jets.[99] Brady threw for 3,900 yards with 36 touchdowns and just four interceptions on the season.[40] He had an 111.0 passer rating, giving him, at the time, two of the top five season ratings in NFL history, and making him the first player to finish with a rating above 110 in two different seasons.[100] Brady was selected as a starter to the 2011 Pro Bowl. However, he pulled out of the game (and was replaced by former backup Matt Cassel of the Kansas City Chiefs) after undergoing surgery for a stress fracture in his right foot dating back to 2008.[101] Brady was also the only unanimous selection for the AP All-Pro Team and was named the 2010 Associated Press NFL Offensive Player of the Year. He won, by unanimous decision, the MVP award for the second time in his career.[102] 2010 postseason After earning a bye week, the Patriots lost to the New York Jets in the divisional playoffs, 28-21. Brady finished the game 29 of 45 for 299 yards and two touchdowns, with one interception. His one pick ended his NFL record of consecutive passes without an interception at 340.[103] 2011 season In Week 1 of the 2011 NFL season, Brady threw for 517 yards and 4 touchdowns, with one interception, against the Miami Dolphins, the second time he had thrown for 400 or more yards in a single game.[104][105] In the regular season finale against the Buffalo Bills, Brady became the fourth quarterback to throw for 5,000 yards in a single season, finishing with 5,235; it surpassed Dan Marino's longstanding record of 5,084 passing yards, but finished the season second behind Drew Brees' 5,476.[40] 2011 postseason    There's no quarterback I'd rather have than Tom Brady. He's the best. He does so much for us in so many ways on so many different levels. I'm very fortunate that he's our quarterback and what he's able to do for this team. It's good to win with him and all the rest of our players. If that's more than somebody else did, I don't really care about that.[106]    Bill Belichick  In the Patriots' 45   10 rout of the Denver Broncos in the Divisional round, Brady set a personal postseason best with 363 passing yards, and tied an NFL record shared by Daryle Lamonica and Steve Young, throwing for 6 touchdown passes.[107] The win, his first postseason win since January 2008, gave Brady and Patriots head coach Bill Belichick sole possession of the NFL record for postseason wins by a QB-coach combo with 15.[108] In the AFC Championship game against the Baltimore Ravens, Brady failed to throw a touchdown pass for the first time in 36 games, though he did pass for 239 yards and scored a 1-yard rushing touchdown late in the game. The Patriots were the beneficiaries of a missed field goal from Ravens kicker Billy Cundiff that saw the Brady and Patriots reach their fifth Super Bowl since Brady joined the team.[109] In Super Bowl XLVI, Brady and the Patriots met the New York Giants, meeting in the Championship for the second time in five years. Brady played well, leading a Super Bowl record-tying 96-yard touchdown drive to close the first half and at one point completing 16 passes in the row for a 20/23 mark partway into the third quarter, another Super Bowl record. In all, he recorded two touchdowns, one interception, and was penalized for intentional grounding in the end zone, leading to a crucial safety for the Giants. A final score of 21   17 for the Giants prevented Brady from winning his fourth Super Bowl.[110] 2012 season Brady started all 16 regular season games of the 2012 NFL season and led the Patriots to a 12   4 record. The Patriot scored 557 total points, the third highest in league history and Brady became the first quarterback to lead his team to 10 division titles. With that point total, the Patriots became the first team to score at least 500 points in a season four different times, with Brady leading all four squads (another record). He finished the season with 4,827 passing yards, 34 touchdowns, only 8 interceptions, and a passer rating of 98.7. It was Brady's third straight season throwing for over 30 touchdowns.[111] 2012 postseason Brady also started both Patriots play-off games, winning against the Houston Texans. With the victory, Brady surpassed Joe Montana for most career playoff wins, with 17. The Patriots were then upset by the eventual Super Bowl champ Baltimore Ravens, 28   13 in the AFC championship. On February 25, 2013, Brady and the Patriots agreed on a three-year contract extension, which will keep him with the team through 2017.[112] Peter King called it an \"amazing\" deal, as Brady took just $27 million in new money over the 2015, 2016, and 2017 seasons, and also noted that it reflected Patriots owner Robert Kraft's desire to make sure Brady retired a Patriot.[113] 2013 season Tom Brady and the New England Patriots began the season with much upheaval on the offensive side of the ball with the injury of Rob Gronkowski, the arrest of Aaron Hernandez, the departure of Wes Welker to the Denver Broncos and Danny Woodhead to the San Diego Chargers in free agency, and the release of Brandon Lloyd. To replace them, the Patriots signed Danny Amendola in free agency, drafted rookies Aaron Dobson and Josh Boyce, and signed undrafted rookie free agent Kenbrell Thompkins. Despite showing good chemistry with his new receiving corps in the preseason, Brady struggled in the first 2 games of the season completing only 52% of his passes (48 out of 91) and only 3 TD and one interception and passer rating under 75.0 in both games.     Brady during the 2013 season   In Weeks 3 and 4, Brady completed over 60% of his passes and threw 4 TDs and 1 interception in wins over the Tampa Bay Buccaneers and Atlanta Falcons. Brady, who was in pursuit of Drew Brees' record of at least one touchdown in 54 consecutive games, saw the streak end at 52 games in a Week 5 loss against the Cincinnati Bengals that held him to 197 yards, completing under 50% of his passes (18 out of 38) for the second time in the season. In a Week 6 game against the New Orleans Saints, the Patriots struggled in the first half and bounced back in the second with Brady going 25 out of 43, for 269 yards and a clutch touchdown pass to Kenbrell Thompkins as time expired to pull out the upset over the Saints. The Patriots improved to 5   1 on the season. In Week 6 against the New York Jets, Brady was outplayed by Geno Smith, despite Rob Gronkowski coming back and having 8 catches for 114 yards. Brady completed 47.8% of his passes, marking the third time in the season he went under 50%. With Gronkowski healthy again, the Patriots had wins in Week 7 against divisional rival Miami Dolphins and Week 8 against the Pittsburgh Steelers, with Brady having his best game of the season going 23 out of 33, for 432 yards 4 TD and 0 interceptions, with a nearly perfect passer rating of 151.8 in a 55   31 win. Brady and the Patriots headed to the bye week with a 7   2 record. In a Week 10 loss to the Carolina Panthers, the Patriots trailed by 4 and Brady, with only 59 second left and three timeouts, drove his offense downfield to Carolina's 18 yard line, and with 3 seconds left, threw a pass to Rob Gronkowski that was intercepted despite the officials calling a defensive pass interference penalty on Luke Kuechly that was waved off. Brady and the 7   3 Patriots began in Week 11 against Peyton Manning and the Denver Broncos, in what was the 14th clash between the two, a series of three dramatic comeback wins. After going to the half trailing by 24, Brady and the Patriots scored 31 unanswered points. The Patriots won after a muffed punt in overtime with a field goal from Stephen Gostkowski. Brady outplayed Peyton Manning, who had been playing at an MVP level, throwing for 344 yards and 3 TDs as Peyton threw for 150 with 1 TD and an interception. After that, the Patriots began their Week 13 and Week 14 matchups trailing in the first half to then pull out comebacks in the 4th quarter. In the Week 15 AFC East clash against the Dolphins, the Patriots could have become, at least temporarily, the number 1 seed in the AFC as well as clinched the AFC East title for 5th season in a row, but this time the 4th quarter comeback was denied as Brady threw an interception as time expired on a potential game winning drive. Brady and the Patriots fell to 10   4. With a Week 16 win over the Baltimore Ravens, Brady collected his 147th win as a starting quarterback and tied Dan Marino for 4th place all time. With the Week 17 win over the Buffalo Bills, Tom Brady tied John Elway for the 3rd place all time in wins as a starting quarterback. 2013 postseason Brady's Patriots finished the season 12   4, to earn the second seed in the AFC and a first-round bye. In the Divisional Round matchup against the Indianapolis Colts, Brady made his 25th playoff appearance, breaking Brett Favre's career record for playoff appearances by a quarterback (Jerry Rice appeared in 29 playoff games). The following week, the Patriots lost to the Denver Broncos, eliminating Brady and the Patriots from the playoffs. 2014 season     Brady in September 2014 vs. the Vikings.   Brady's Patriots once again finished 12-4, this after a late-preseason trade of guard Logan Mankins to Tampa Bay for tight end Tim Wright. Brady started the season with a 33-20 loss to the Miami Dolphins. It was Brady's first opening day loss since 2003. Brady was good for 241 yards and a touchdown. New England rebounded against the Minnesota Vikings, but Brady struggled, throwing for 149 yards and a touchdown in a 30-7 win. Against the Oakland Raiders Brady was pressured all day, but threw for 234 yards and a touchdown in 16-9 win. After a 41-14 loss to the Kansas City Chiefs, Brady led New England to back-to-back wins, including his first 300-yard performance of the season, against the Buffalo Bills. Brady then defeated the New York Jets with a 261-yard performance that included 3 touchdowns. The following week, a 51-23 embarrassment of the Chicago Bears saw Brady throw for 354 yards and a season-high 5 touchdowns. After passing for 333 yards, and 257 yards in his next two games against the Denver Broncos and Indianapolis Colts respectively, Brady defeated the Detroit Lions 34-9 with 349 passing yards and 2 touchdowns against only one interception. The Patriots winning streak was put to the test against the Green Bay Packers in week 13. Down 13-0 early, Brady threw for 2 touchdowns, no picks, and 245 yards. Still down 26-21, Brady was unable to give the Patriots their 8th straight victory. After trailing 14-3 at the San Diego Chargers, Brady rallied his team with 317 passing yards, 2 touchdowns, and only one pick, to a 23-14 comeback win. Brady clinched his NFL record 12th AFC East division title with 287 passing yards, 2 touchdowns and a pick. Brady struggled in his final two games, throwing for only 182 yards, a touchdown, and an interception in 17-16 victory against the Jets, and 80 yards in one half of a game against the Buffalo Bills, a 17-9 loss. 2014 postseason In a 35-31 Divisional Round win over the Ravens, Brady threw for three touchdowns and ran in a fourth, breaking Curtis Martin's club record for rushing touchdowns in the playoffs; Brady also broke Joe Montana's record for playoff touchdowns with 46. After the Ravens scored on their first two possessions, the Patriots were quickly down 14-0. Brady led New England on an 8 play, 78 yard drive, and ran for a score to cut the Raven lead to 14-7. In the second quarter, Brady's 15 yard touchdown pass to Danny Amendola tied the score at 14-14. After getting the ball back, Brady threw an interception at the end of the first half. Joe Flacco capitalized on it by throwing an 11-yard touchdown strike to Owen Daniels to give Baltimore a 21-14 halftime lead. Down 28-14, Brady engineered an 80-yard drive, culminating in a touchdown to Rob Gronkowski to cut the lead to 28-21. With the score tied at 28, Ravens kicker Justin Tucker drilled a 25-yard field goal to give Baltimore a 31-28 4th quarter lead. Brady got the ball back, and threw a 23-yard touchdown to Brandon LaFell to give the Patriots their first lead, up 35-31. After a Duron Harmon interception and a Joe Flacco Hail Mary attempt failed, Brady clinched his record 9th AFC Championship Game, fourth straight, and the third championship game against the Indianapolis Colts. After a 45-7 blowout, Brady advanced to play his record breaking sixth Super Bowl, breaking a tie with John Elway. In Super Bowl XLIX, Brady completed 37-50 passes for 328 yards, 4 touchdowns and 2 interceptions. He guided a 10-point 4th quarter comeback as the Patriots defeated the Seattle Seahawks 28-24 to give Brady his fourth Super Bowl ring, tying him with Joe Montana and Terry Bradshaw for most Super Bowl victories by a starting quarterback. He was named Super Bowl MVP for the third time, tying Montana's record for most Super Bowl MVP's. His 37 complete passes in the game is a Super Bowl record.[114] Deflategate Further information: Deflategate On May 6, 2015, the NFL published a 243-page report regarding the deflation of footballs used in the AFC Championship game.[115] The report concluded that, more likely than not, Brady was at least generally aware of the intentional deflation. On May 11, Brady was suspended for four games by the NFL for his involvement based on \"substantial and credible evidence\" that Brady knew Patriots employees were deflating footballs and that he failed to cooperate with investigators.[116] NFL Executive Vice President of Football Operations, Troy Vincent's May 11 letter to Brady stated in part: \"Your actions as set forth in the report clearly constitute conduct detrimental to the integrity of and public confidence in the game of professional football.\"[117] Troy Vincent's letter further stated: \"With respect to your particular involvement, the report established that there is substantial and credible evidence to conclude you were at least generally aware of the actions of the Patriots' employees involved in the deflation of the footballs and that it was unlikely that their actions were done without your knowledge. Moreover, the report documents your failure to cooperate fully and candidly with the investigation, including by refusing to produce any relevant electronic evidence (emails, texts, etc.), despite being offered extraordinary safeguards by the investigators to protect unrelated personal information, and by providing testimony that the report concludes was not plausible and contradicted by other evidence.\" [117] Brady, through the NFL Players Association, officially appealed the suspension on May 14.[118] On July 28, NFL Commissioner Roger Goodell upheld Brady's suspension.[119] Brady has reportedly given permission to the NFLPA to appeal the suspension in federal court.[120] On July 28, the NFL announced the upholding of the four-game suspension, citing Brady's destruction of his cell phone as a critical factor: \"On or shortly before March 6, the day that Tom Brady met with independent investigator Ted Wells and his colleagues, Brady directed that the cell phone he had used for the prior four months be destroyed,\" the league statement read. \"He did so even though he was aware that the investigators had requested access to text messages and other electronic information that had been stored on that phone. During the four months that the cell phone was in use, Brady had exchanged nearly 10,000 text messages, none of which can now be retrieved from that device. The destruction of the cell phone was not disclosed until June 18, almost four months after the investigators had first sought electronic information from Brady.\"[121][122] The NFL also filed papers in Manhattan federal court seeking to confirm Roger Goodell's decision.[123] On July 29 Brady released a statement on his Facebook page criticizing Goodell's decsion to uphold the suspension, saying in part \"I am very disappointed by the NFL's decision to uphold the 4 game suspension against me. I did nothing wrong, and no one in the Patriots organization did either... I will not allow my unfair discipline to become a precedent for other NFL players without a fight.\"[124][125] Commentary on the initial punishment was mixed. Bleacher Report referred to the penalties as \"brutal\".[126] Various commentators also implied that the prior reputation of the Patriots organization as a team that bends rules appeared to factor into the harshness of the punishment.[126][127] Others described the punishment as \"firm but fair\".[128] Brady's suspension was overturned by Judge Richard M. Berman on September 3, 2015, allowing him to play in the first four games of the 2015 season.[129] 2015 season Brady returned for the preseason opener against the Packers, but he completed only one pass for 10 yards in the first quarter, leaving backup Jimmy Garoppolo to play the rest of the game. Brady led the Patriots to a 28-21 win over the Steelers on Week 1. He threw for 288 yards and 4 touchdowns, three of them to Rob Gronkowski. The win gave Brady the 161st of his career, surpassing the record held by Brett Favre for most wins by a quarterback with a single team. In week 2, Brady followed his performance up by throwing for 466 yards and 3 touchdowns against the Bills. Through the first five games of the season, Brady has thrown 14 touchdowns with 1 interception and a quarterback rating of 118.4. Professional statistics    LEGEND    Super Bowl champions   AFC champions   Bold - League leader   Regular season    New England Patriots     Passing[130] Rushing Sacked Fumbles Team record   Year Team G GS Comp Att Pct Yds Y/A TD Int Rtg Att Yds Avg TD Sack Yds Fum Lost W/L (as starter)   2000 NE 1 0 1 3 33.3 6 2.0 0 0 42.4 0 0 0 0 0 0 0 0 0-0   2001 NE 15 14 264 413 63.9 2,843 6.9 18 12 86.5 36 43 1.2 0 41 216 12 3 11-3   2002 NE 16 16 373 601 62.1 3,764 6.3 28 14 85.7 42 110 2.6 1 31 190 11 5 9-7   2003 NE 16 16 317 527 60.2 3,620 6.9 23 12 85.9 42 63 1.5 1 32 219 13 5 14-2   2004 NE 16 16 288 474 60.8 3,692 7.8 28 14 92.6 43 28 0.7 0 26 162 7 5 14-2   2005 NE 16 16 334 550 63.0 4,110 7.8 26 14 92.3 27 89 3.3 1 26 188 4 3 10-6   2006 NE 16 16 319 516 61.8 3,529 6.8 24 12 87.9 49 102 2.1 0 26 175 12 4 12-4   2007 NE 16 16 398 578 68.9 4,806 8.3 50 8 117.2 37 98 2.6 2 21 128 6 4 16-0   2008 NE 1 1 7 11 63.6 76 6.9 0 0 83.9 0 0 0 0 0 0 0 0 1-0   2009 NE 16 16 371 565 65.7 4,398 7.8 28 13 96.2 29 44 1.5 1 16 86 4 2 10-6   2010 NE 16 16 324 492 65.9 3,900 7.9 36 4 111.0 31 30 1.0 1 25 175 3 1 14-2   2011 NE 16 16 401 611 65.6 5,235 8.6 39 12 105.6 43 109 2.5 3 32 173 6 2 13-3   2012 NE 16 16 401 537 63.0 4,827 7.6 34 8 98.7 23 32 1.4 4 27 182 2 0 12-4   2013 NE 16 16 380 628 60.5 4,343 6.9 25 11 87.3 32 18 0.6 0 40 256 9 3 12-4   2014 NE 16 16 373 582 64.1 4,109 7.1 33 9 97.4 36 57 1.6 0 21 134 6 3 12-4   2015 NE 6 6 173 251 63.0 2,054 8.2 16 1 113.2 18 19 1.1 2 16 91 3 1 6-0   Total 215 213 4,724 7,419 63.7 55,312 7.5 408 144 96.5 488 842 1.7 16 380 2,375 98 41 166-47   Playoffs    New England Patriots     Passing[131] Rushing Sacked Fumbles   Year Team G GS Comp Att Pct Yds Y/A TD Int Rtg Att Yds Avg TD Sack Yds Fum Lost   2001 NE 3 3 60 97 61.9 572 5.9 1 1 77.3 8 22 2.8 1 5 36 1 0   2003 NE 3 3 75 126 59.5 792 6.3 5 2 84.5 12 18 1.5 0 0 0 0 0   2004 NE 3 3 55 81 67.9 587 7.2 5 0 109.4 7 3 0.4 1 0 0 1 1   2005 NE 2 2 35 63 55.6 542 8.6 4 2 92.2 3 8 2.7 0 4 12 2 0   2006 NE 3 3 70 119 58.8 724 6.1 5 4 76.5 8 18 2.2 0 4 22 2 0   2007 NE 3 3 77 109 70.6 737 6.8 6 3 96.0 4    1    0.2 0 8 52 1 1   2009 NE 1 1 23 42 54.8 154 3.7 2 3 49.1 0 0 0 0 3 22 1 1   2010 NE 1 1 29 45 64.4 299 6.6 2 1 89.0 2 2 1.0 0 5 40 1 0   2011 NE 3 3 75 111 67.6 878 7.9 8 4 100.4 9 10 1.1 1 3 15 0 0   2012 NE 2 2 54 94 57.4 664 7.1 4 2 84.7 3 4 1.3 0 1 9 0 0   2013 NE 2 2 37 63 58.7 475 7.5 1 0 87.7 3 6 2.0 1 4 34 1 0   2014 NE 3 3 93 135 68.9 921 6.8 10 4 100.3 9 13 1.4 1 3 16 0 0   Total    29 29 683 1,085 62.9 7,345 6.8 53 26 89.0 68 103 1.5 5 45 305 10 3       Career totals including 2014 postseason. Super Bowl    New England Patriots     Passing[132] Rushing   Year SB Team Opp Comp Att Pct Yds Y/A TD Int Rtg Att Yds Avg TD   2001 XXXVI NE STL 16 27 59.3 145 5.4 1 0 86.2 1 3 3.0 0   2003 XXXVIII NE CAR 32 48 66.7 354 7.4 3 1 100.5 2 12 6.0 0   2004 XXXIX NE PHI 23 33 69.7 236 7.2 2 0 110.2 1 -1 -1.0 0   2007 XLII NE NYG 29 48 60.4 266 5.5 1 0 82.5 0 0 0 0   2011 XLVI NE NYG 27 41 65.9 276 6.7 2 1 91.5 0 0 0 0   2014 XLIX NE SEA 37 50 74.0 328 6.6 4 2 101.1 2 -3 -1.5 0   Career 6   164 247 66.4 1,605 6.5 13 4 95.3 6 11 1.8 0   NFL records NFL (career)  Most games, 145+ passer rating, career: 13 Most games, 125+ passer rating, season: 7 Highest completion percentage, post-season game (minimum 20 attempts): 92.9 Most games with at least 75% pass completion rate and no interceptions, season (minimum 20 attempts per game): 6 Highest completion percentage, game (minimum 6 TD passes): 85.3 Longest pass completion: 99 yards ( tied with 12 other QB's) Most Passing Touchdowns, Season, Away: 29 Most Games 3+ TD Passes, Season: 12 Most consecutive home games with 1+ touchdown pass: 47 Most Consecutive Uninterrupted Games, 1+ Touchdown Passes: 52 Most Consecutive Games, 3+ Touchdown Passes: 10 Most Passing Touchdowns, one quarter: 5 Most games, 115+ passer rating, season: 10, Aaron Rodgers 2011, Tom Brady 2007, Steve Young 1994 Most games, 120+ passer rating, season: 8, Tom Brady, 2007, Philip Rivers, 2008 Most games, 140+ passer rating, season: 4, Jacky Lee 1961, Roger Staubach 1973, Tom Brady 2007 & 2010, Aaron Rodgers 2011 & 2014 Most games, 145+ passer rating, season: 4, Tom Brady 2007, Roger Staubach 1973 Most games, 150+ passer rating, season: 2, Steve Young 1993, Kurt Warner 1999, Tom Brady 2007, Drew Brees 2009, Aaron Rodgers 2014 Most seasons, 110+ passer rating: 2, Tom Brady 2007-2010, Peyton Manning 2004-2013, Aaron Rodgers 2011-2014 Most games 35 completions, season: 3, Tom Brady 2002, Rich Gannon 2002 and Peyton Manning 2010 Most passing yards, any quarter: 252, Tom Brady on October 19, 2009; Boomer Esiason on November 10, 1996 Most consecutive 400+ yards passing games: 2; Dan Fouts, 1982; Dan Marino, 1984; Phil Simms, 1985; Billy Volek, 2004; Matt Cassel, 2008; Cam Newton, 2011, Tom Brady, 2011; Philip Rivers, 2013 Most Games 1+ TD Passes, Season: 16, Dan Marino, 1984, 1986; Dave Krieg, 1984; Kurt Warner, 1999; Brett Favre, 2003; Daunte Culpepper, 2004; Tom Brady, 2010   2012; Drew Brees, 2010   2011, 2013-2014; Matthew Stafford, 2011; Peyton Manning, 2012   2013; Philip Rivers, 2013; Ben Roethlisberger, 2013 Most Seasons, 50+ Touchdown Passes: 1, Tom Brady, 2007; Peyton Manning, 2013 Most Consecutive Games, 5+ Touchdown Passes: 2, Ben Roethlisberger 2014, Tom Brady 2007, Daunte Culpepper 2004, Tom Flores (AFL) 1963, Most consecutive home wins, regular season, by a starting quarterback: 31, Tom Brady, New England Patriots, 2006   2011 Most road wins in a season, regular season, by a starting quarterback: 8, Joe Montana, San Francisco 49ers, 1990; Kurt Warner, St. Louis Rams, 2001; Tom Brady, New England Patriots, 2007; Tony Romo, Dallas Cowboys, 2014 Most wins in a season, regular season and post-season, by a starting quarterback: 18, Tom Brady, New England Patriots, 2007 Most wins in a season, regular season, by a starting quarterback: 16, Tom Brady, New England Patriots, 2007 Most consecutive wins against a single opponent, regular season and post-season, by a starting quarterback: 13, Steve Young, San Francisco 49ers, vs. Los Angeles/St. Louis Rams, 1987, 1991   1998; Tom Brady, New England Patriots vs. Buffalo Bills, 2003   2010 Most career wins with one team: 164 Fewest pass attempts to reach 400 passing touchdowns: 7,282  Playoffs (career)  Most games played - 29[133] Most games started for a quarterback - 29 Most games won as starting quarterback - 21 Most consecutive wins, post-season, by a starting quarterback: 10 Most consecutive wins to start a career, post-season, by a starting quarterback: 10, Tom Brady, New England Patriots, 2001, 2003   2005 Most career home wins, post-season, by a starting quarterback: 14, Tom Brady, New England Patriots, 2001   2015 Most consecutive home wins, post-season, by a starting quarterback: 8, Tom Brady, New England Patriots, 2001   2007; Jim Kelly, Buffalo Bills 1988, 1990   1991, 1993, 1995 Most touchdown passes - 53 Most yards gained - 7,345 Most passes completed - 683 Most passes attempted - 1,085 Most division titles for a starting quarterback - 12 Most NFL conference championship appearances for a starting quarterback - 9 Most NFL conference championship wins for a starting quarterback - 6  Super Bowl (career)  Most touchdown passes - 13[134] Most yards gained - 1,605 Most passes completed - 164 Most passes attempted - 247 Most passes completed in first half of a single Super Bowl - 20 Most passes completed in a single Super Bowl - 37 Most Super Bowl appearances - 6 (tied with Mike Lodish)  Personal life     Brady riding a bicycle for charity at the Best Buddies Ride in Hyannis, Massachusetts in May 2009.   Brady dated actress Bridget Moynahan from 2004 until late 2006.[135] On February 18, 2007, Moynahan confirmed to People magazine that she was more than three months pregnant with Brady's and her child.[135][136] Brady and Moynahan ended their relationship sometime in early December 2006, around the time Moynahan became pregnant.[137] Though not in the delivery room when their son, John Edward Thomas Moynahan,[138] was born in August 2007 at Saint John's Health Center in Santa Monica, California,[139] Brady was present the day of the birth.[140] John's middle names are Brady's own first and middle names in reverse order, while Moynahan's father's first name is Edward. Brady began dating Brazilian supermodel Gisele B  ndchen in December 2006.[141] In 2009 Brady revealed they had been set up on a blind date by a mutual friend.[142] Brady and B  ndchen married on February 26, 2009 in an intimate Catholic ceremony in Santa Monica.[143][144] In April 2009, the couple held a second marriage ceremony, in Costa Rica.[145] Together, the couple have two children: son Benjamin Rein Brady (born December 2009),[146][147] whose middle name is a shortened version of B  ndchen's father's name Reinoldo;[148] and daughter Vivian Lake Brady (born December 2012).[149] The family moved to a $20 million mansion in the Brentwood neighborhood of Los Angeles in January 2012[150] and subsequently bought a $14 million condominium at One Madison in Manhattan in October 2013. They are building another home near Boston.[151] Brady has also been featured as a guest star on some popular television programs, hosting Saturday Night Live in 2005[152] and voiced himself on The Simpsons in 2005 and Family Guy in 2006, with both episodes (\"Homer and Ned's Hail Mary Pass\" and \"Patriot Games\") being football themed and broadcast within a week of that year's Super Bowl.[153][154] In 2009 he appeared as himself on an episode of Entourage. In 2015 he had cameo appearances in the Entourage movie and Ted 2, playing a fictionalized version of himself in both. Brady and baseball player Kevin Youkilis became brothers-in-law in 2012 when Youkilis married Brady's sister, Julie.[155] Brady has endorsed brands including Uggs, Under Armour, Movado watches, and Glaceau Smartwater. According to Forbes, Brady earned about $7 million in endorsements alone in 2014.[156][157][158] See also  Lists of Michigan Wolverines football passing leaders List of most career 300-yard passing games in the NFL List of most wins by a National Football League starting quarterback NFL starting quarterback playoff records List of Saturday Night Live guests          American football portal Biography portal College football portal Michigan portal New England portal         References   ^ \"Tom Terrific: Patriots QB Brady leads 28-24 comeback over Seahawks\". CTVNews. Retrieved 29 July 2015. ^ \"Brady is Tom Terrific\". The Daily Gazette. Retrieved 29 July 2015. ^ \"Legends Never Rest: Tom Brady Gets Right Back to Working Out\". Boston.com. Retrieved 29 July 2015. ^ \"Sources: Brady out with ACL tear\". Yahoo Sports. Retrieved 29 July 2015. ^ \"Tom Brady\". Pro-Football-Reference.com. Retrieved 29 July 2015. ^ a b Hochman, Benjamin (2 February 2015). \"Tom Brady greatest QB of all time? It's now safe to make that argument\". Denver Post.\"Tom Brady Cements His Legacy as Greatest Quarterback of All Time\". Bleacher Report. 2 February 2015. ^ Breech, John. \"Tom Brady breaks Joe Montana's Super Bowl TD pass record\". CBSSports.com. Retrieved 2015-02-03. ^ Zimmer, John; Marini, Matt, eds. (2013). Official 2013 National Football League Record & Fact Book (PDF). New York: National Football League. ISBN 978-1-603-20980-9. Retrieved February 3rd, 2015. ^ Wilner, Barry (2013-01-13). \"Patriots beat Texans 41   28, Ravens up next\". Yahoo! Sports. Retrieved 2013-01-13. ^ \"Tom Brady bio at\". TV Guide. Retrieved 2012-08-04. ^ \"Little brother big shot-thepostgame\". Retrieved 2010-02-02. ^ \"Gisele, Tom Brady Christen Baby Benjamin\". Us Weekly. 2010-06-23. Retrieved 2010-09-12. ^ Collie, Ashley Jude (2004-07-01). \"The Brady Brunch\". American Way. Retrieved 2010-09-27. ^ Schorn, Daniel (2007-12-23). \"Tom Brady: The Winner\". CBS News. Retrieved 2011-01-11. ^ \"Tom Brady Family Tree\". Makemyfamilytree.com. Retrieved 2012-08-04. ^ \"Tom Brady\". ethnicelebs.com. ^ Judge, Clark (2005-02-07). \"Only 27, Brady seals his Hall of Fame credentials\". CBSSports.com. Retrieved 2007-12-26. ^ \"New England Patriots vs. Oakland Raiders     Recap     October 2, 2011\". ESPN. 2011-10-02. Retrieved 2011-10-29. ^ Jim Ducibella (June 28, 2005), \"W&M's football facilities growing\", Virginia Pilot and Ledger-Star: 3, retrieved January 12, 2014 ^ Profile, boston.com; accessed November 12, 2014. ^ \"2004 Athletic Hall of Fame Inductees\". Jun  pero Serra High School. Archived from the original on 2007-09-27. Retrieved 2007-12-26. ^ \"Tom Brady     Official New England Patriots biography\". New England Patriots. Retrieved 2010-01-11. ^ Knoblauch, Max (September 18, 2014). \"Tom Brady's Old Internships Look Really Cute on His R  sum  \". Mashable. Retrieved September 25, 2014. ^ Aaron Kinney (February 24, 2012). \"Serra to name football stadium after Brady\". San Jose Mercury News. Retrieved 3 February 2015. ^ Bradford, Rob (2009-01-19). \"The Tom Brady Interview (in Toronto)\". WEEI Sportsradio Network. ^ a b Rosenberg, Michael (January 9, 2012). \"Tom Brady As You Forgot Him: Before he became the premier postseason performer of his generation, the Patriots icon was a middling college quarterback who invited skepticism, even scorn, from fans and his coaches. That was all   and that was everything\". Sports Illustrated. Retrieved 2015-08-22. ^ Jenkins, Lee (2008-01-31). \"Self-made man\". Sports Illustrated. Retrieved 2010-01-11. ^ Pedulla, Tom (2006-10-31). \"Decorated Patriots QB feels he still has something to prove\". USA Today. Retrieved 2007-12-27. ^ \"Tom Brady's Guru\", by Eric Adelson, January 11, 2011. ^ 60 Minutes Sports. (Interview). YouTube. ^ \"MGoBlue Statistics Archive\". University of Michigan. Retrieved 2007-12-27. ^ \"Capital One Bowl: Capital One Bowl football game resource for college football fans\". 2008-09-05. Retrieved 2008-09-05. ^ \"Full 2000 NFL Draft\". National Football League. Retrieved August 14, 2012. ^ Holley, Michael (2004). Patriots Reign. HarperCollins. ISBN0-06-075794-9. ^ \"Top 10 NFL draft steals\". Msn.foxsports.com. Retrieved 2011-10-29. ^ \"NFL's top 10 draft steals in league history\". National Football League. 2010-04-18. Retrieved 2011-10-29. ^ Football, National. \"news: Brady, Favre, Manning voted to list of top 10 draft picks of all time\". National Football League. Retrieved 2011-10-29. ^ \"Best NFL Draft Picks\". Mynfldraft.com. Retrieved 2011-10-29. ^ \"Coach Hears Venom\\Belichick Part of Problem?\". Worcester Telegram and Gazette. November 14, 2000. Retrieved August 15, 2012. ^ a b c d e f g h i j \"Tom Brady     #12 QB\". National Football League. ^ Lowe, Mike (September 24, 2012). \"Pats fizzle when it counts\". Portland Press Herald. Retrieved August 14, 2012. ^ a b c d e f \"Tom Brady\". National Football League. Retrieved 2007-12-26. ^ Cafardo, Nick (October 15, 2001). \"Something special: Brady-led rally erases mates' earlier errors\". The Boston Globe. Retrieved August 14, 2012. ^ Cafardo, Nick (October 1, 2012). \"Hold your horses: Patriots rout Colts as defense shows season is not lost\". Boston Globe. Retrieved August 14, 2012. ^ \"NFL Pro Bowl 2002     National Football League game summary\" (PDF). National Football League. Retrieved August 14, 2012. ^ Howe, Jeff. \"Patriots reflect on 'Snow Bowl' during 10-year anniversary of tuck rule game\". NESN. Retrieved August 15, 2012. ^ \"Bledsoe's return sparks Patriots past Steelers 24   17\". CNN. Associated Press. Archived from the original on December 25, 2005. ^ Caesar, Dan (January 30, 2002). \"14-Point spread isn't about respect\". St. Louis Post-Dispatch. Retrieved August 15, 2012. ^ Cotey, John (January 26, 2003). \"Madden sticks by his wrong call last year\". St. Petersburg Times. Retrieved August 15, 2012. ^ Silverstein, Tom; Cliff Christl (February 4, 2002). \"Brady coolly fits the bill\". Milwaukee Journal Sentinel. ^ \"2002 NFL Standings, Team & Offensive Statistics\". Pro Football Reference. Retrieved August 14, 2012. ^ \"2003 New England Patriots\". Pro Football Reference. Retrieved August 14, 2012. ^ Wilner, Barry (2004-01-02). \"Manning. McNair split MVP honors\". USA Today. Retrieved August 14, 2012. ^ \"Super Bowl XXXVIII MVP: Tom Brady\". National Football League. Retrieved August 14, 2012. ^ \"Longest Winning Streaks\". Pro Football Hall of Fame. Retrieved 2010-01-03. ^ \"Bill Belichick     Head Coach\". New England Patriots. Retrieved August 14, 2012. ^ a b \"2004 NFL Standings, Team & Offensive Statistics\". Pro Football Reference. Retrieved August 14, 2012. ^ \"Quarterback fought 103-degree fever, chills\". Associated Press. ^ \"Super Bowl XXXIX\". National Football League. Retrieved August 14, 2012. ^ \"Dillon Returns From Injury To Push Patriots Past Jets\". Lakeland Ledger. December 5, 2005. Retrieved August 15, 2012. ^ Cafardo, Nick (2005-11-02). \"Dillon's resolve solved a few offensive problems\". The Boston Globe. Retrieved August 15, 2012. ^ \"2005 NFL Standings, Team & Offensive Statistics\". Pro Football Reference. Associated Press. Retrieved August 14, 2012. ^ Drehs, Wayne. \"Brady, Patriots finally feel playoff defeat\". ESPN. Retrieved August 14, 2012. ^ Reiss, Mike (2006-01-31). \"Brady's groin may be hurt\". The Boston Globe. Retrieved 2007-12-26. ^ \"2006 NFL Standings, Team & Offensive Statistics\". Pro Football Reference. Retrieved August 14, 2012. ^ Maske, Mark (2006-12-19). \"Romo Gets Pro Bowl Nod in NFC, Brady Doesn't in AFC\". The Washington Post. Retrieved 2007-12-26. ^ McClain, John (2007-07-02). \"=Young to replace Rivers at Pro Bowl\". Houston Chronicle. Retrieved 2007-12-26. ^ \"Brady, Patriots shake feisty Jets, roll on to San Diego\". ESPN. Retrieved August 14, 2012. ^ Hayes, Neil. \"Super Chargers top Super Bowl list\". NBC Sports. Retrieved August 14, 2012. ^ Clayton, John. \"Patriots teach Chargers a lesson in playoff football\". ESPN. Retrieved August 14, 2012. ^ Pasquarelli, Len. \".Manning shakes label of not being able to win big one\". ESPN. Retrieved August 14, 2012. ^ Byrne, Kerry J. (2009-06-03). \"Best individual seasons of 2000s\". Sports Illustrated. Retrieved 2010-01-11. ^ Top 10 greatest quarterback seasons, NFL Nation Blog, espn.go.com; accessed November 12, 2014. ^ \"2007 New England Patriots\". Pro Football Reference. Retrieved 2010-01-11. ^ Banks, Don (2007-10-12). \"Litmus test\". Sports Illustrated. Retrieved 2007-12-08. ^ \"Brady's six TDs give him 27 TDs after seven games\". ESPN. ^ Young, Shalise Manza (2007-11-04). \"Patriots 24, Colts 20: Tom's got you, Babe\". The Providence Journal. Retrieved 2007-12-26. ^ \"Brady an easy winner in AP Male Athlete of Year balloting\". USA Today. Associated Press. December 21, 2007. Retrieved 2012-01-28. ^ Mihoces, Gary (January 13, 2008). \"Perfect Pats, Brady make short work of Jaguars\". USA Today. Retrieved 2008-11-30. ^ \"Pats put away Chargers for fourth Super Bowl berth in seven years\". ESPN. Associated Press. 2008-01-20. Retrieved 2008-11-30. ^ \"Foot injury may sideline Tom Brady for another game\". Associated Press. USA Today. August 2008. Retrieved 28 September 2015. ^ \"Brady to have season-ending knee surgery, will be placed on IR\". NFL.com. ^ Reiss, Mike (2008-09-08). \"Pats confirm Brady out for the year\". The Boston Globe. Archived from the original on July 25, 2012. Retrieved 2008-09-08. ^ Springer, Shira (2008-09-10). \"Sources: Brady tore ACL and MCL\". The Boston Globe. Retrieved 2008-09-10. ^ \"Chronic right shoulder injury slows Brady\". NBC Sports. Associated Press. 2007-09-06. Retrieved 2007-12-27. ^ Farmer, Sam (2009-06-02). \"Tom Brady's doctor says knee recovery exceeds expectations\". Los Angeles Times. Retrieved 2011-11-07. ^ \"Brady Has More Procedures Done on Knee, Report Says\". The New York Times. Associated Press. 2008-10-23. Retrieved 2008-11-30. ^ Springer, Shira (2008-10-24). \"Brady's recovery hits snag\". The Boston Globe. Retrieved 2008-11-30. ^ Keefe, Neil. \"Brady Named AFC Offensive Player of the Week\". NESN. Retrieved August 14, 2012. ^ \"Brady throws six TD passes as Patriots ice winless Titans\". Associated Press. Retrieved August 14, 2012. ^ \"Brady sets a record for TDs in a quarter\". The Washington Times. 2009-10-19. Retrieved 2010-01-11. ^ Breer, Albert R. (2010-01-04). \"Brady dealing with broken finger on throwing hand\". The Boston Globe. Retrieved 2010-01-04. ^ \"Brady named Comeback Player of the Year\". NBC Sports. Associated Press. 2010-01-06. Retrieved 2010-01-06. ^ \"Ravens' fast start puts Pats on heels, out of playoffs\". ESPN. Associated Press. 2010-01-10. Retrieved 2010-01-20. ^ Battista, Judy (2010-09-10). \"Patriots' Brady Signs League's Richest Deal, at the Moment\". The New York Times. Retrieved 2010-09-11. ^ Matuszewski, Erik (2010-10-04). \"Tom Brady Gets 100th Career Win in NFL as Patriots Rout Dolphins 41   14\". Bloomberg. Retrieved 2010-10-11. ^ \"Woodhead keeps contributing as Pats withstand Colts comeback attempt\". National Football League. Associated Press. 2010-11-21. Retrieved 2010-11-22. ^ Krasner, Steven (2010-11-21). \"Brady ties mark with 25th straight home W\". ESPNBoston.com. Retrieved 2010-11-22. ^ \"Patriots destroy Jets\". London Free Press. Retrieved August 14, 2012. ^ \"NFL Single-Season Passer Rating Leaders\". ^ Springer, Shira and Monique Walker (2011-01-20). \"Brady to have foot surgery today\". The Boston Globe. Retrieved 2011-01-20. ^ \"Tom Brady unanimous as NFL MVP\". Associated Press. Retrieved August 14, 2012. ^ \"Jets back up talk as Sanchez throws three TDs, defense knocks down Brady\". Retrieved 2014-12-29. ^ \"Tom Brady picks apart Dolphins as 517-yard, 4-TD opener fuels Pats\". ESPN. September 12, 2011. Retrieved September 13, 2011. ^ \"Tom Brady, Chad Henne Combine For Slew of NFL Records On Monday Night Football\". September 13, 2011. Retrieved September 17, 2011. ^ \"Belichick: 'No quarterback I'd rather have'\". weei.com. ^ \"Quinton Carter, David Bruton exit hurt\". ESPN. Retrieved August 14, 2012. ^ Cannizzaro, Mark. \"Patriots redefine postseason success for coach-quarterback duo\". New York Post. Retrieved August 16, 2012. ^ \"Patriots Beat Ravens 23   20 in AFC Championship Game\". Fox News. Associated Press. 2012-01-22. Retrieved August 14, 2012. ^ \"For second time in five seasons, Giants top Brady, Patriots in Super Bowl\". Associated Press. Retrieved August 14, 2012. ^ Tom Brady. \"Tom Brady, QB for the New England Patriots at\". Nfl.com. Retrieved 2013-07-06. ^ Wesseling, Chris (2013-02-25). \"Tom Brady, New England Patriots agree to extension\". National Football League. Retrieved 2013-02-25. ^ Peter King (2013-02-26). \"More on Tom Brady's amazing deal; mail     NFL     Peter King     SI.com\". Sportsillustrated.cnn.com. Retrieved 2013-07-06. ^ \"Patriots beat the Seahawks in dramatic finale\". BBC Sport. 1 February 2015. Retrieved 2 February 2015. ^ \"INVESTIGATIVE REPORT CONCERNING FOOTBALLS USED DURING THE AFC CHAMPIONSHIP GAME ON JANUARY 18, 2015\" (PDF). nfl.com. National Football League. Retrieved 6 May 2015. ^ Rosenthal, Gregg (May 11, 2015). \"Patriots' Tom Brady suspended 4 games\". National Football League. Retrieved May 11, 2015. ^ a b \"NFL releases statement on Patriots' violations\". National Football League. May 11, 2015. Retrieved May 12, 2015. ^ Patra, Kevin (May 14, 2015). \"Tom Brady NFLPA appeal four game suspension\". National Football League. Retrieved May 14, 2015. ^ \"NFL upholds four-game suspension of Tom Brady\". cbsnews.com. 28 July 2015. Retrieved 29 July 2015. ^ \"Report: Tom Brady Authorizes NFLPA To Appeal His Case In Federal Court\". NESN.com. Retrieved 29 July 2015. ^ Rosenthal, Gregg (July 28, 2015). \"Roger Goodell upholds Tom Brady suspension\". National Football League. Retrieved July 28, 2015. ^ Gantt, Darin (July 28, 2015). \"Goodell cites destroying phone in upholding Tom Brady's suspension\". NBC Sports. Retrieved July 28, 2015. ^ Armstrong, Kevin; et al. (July 28, 2015). \"NFL hopes to have expected Tom Brady lawsuit in New York and not Minnesota\". New York Daily News. Retrieved July 28, 2015. ^ \"Tom Brady rips the NFL's Deflategate decision on his Facebook page\". USA Today. ^ https://sports.yahoo.com/blogs/nfl-shutdown-corner/robert-kraft-attacks-the-nfl--apologizes-to-patriots-fans-144058893.html ^ a b Mike Freeman (11 May 2015). \"NFL Deflategate Message: No Player Is Above the Rules, Not Even Tom Brady\". Bleacher Report. ^ Eric Adelson (11 May 2015). \"Tom Brady allowed the new NFL Way to smack Patriot Way in stunning fashion\". Yahoo! Sports. Somewhere along the line, the debate over what happened in the hours and minutes leading up to the AFC championship game in January went beyond air pressure and weather conditions, and became a referendum on the character of Tom Brady and his franchise. ^ Ian O'Connor. \"Tom Brady should skip appeal, tell truth now\". ESPN.com. Retrieved 12 May 2015. ^ https://cbsboston.files.wordpress.com/2015/09/bermandecision.pdf ^ \"Tom Brady\". Pro-Football-Reference.com. Retrieved 29 July 2015. ^ \"Tom Brady\". Pro-Football-Reference.com. Retrieved 29 July 2015. ^ \"Tom Brady\". Pro-Football-Reference.com. Retrieved 29 July 2015. ^ \"NFL Playoff Records: Individual - Passing\". nfl.com. Retrieved 29 July 2015. ^ \"Super Bowl Records: Individual - Passing\". nfl.com. Retrieved 29 July 2015. ^ a b Dagostino, Mark (2006-12-14). \"Tom Brady, Bridget Moynahan Split Up\". People. Retrieved 2007-12-27. ^ Smith, Liz (2007-02-18). \"It's Brady Baby For 'Sixy' Star\". New York Post. Retrieved 2007-12-27. ^ Shanahan, Mark (2007-02-18). \"Ex-Brady Girlfriend Says She's Pregnant With His Child\". The Boston Globe. Retrieved 2008-11-30. ^ Boehm, Kristin (2007-08-28). \"Bridget Moynahan 'Thankful' for Healthy Baby\". People. Retrieved 2008-11-30. ^ \"Bridget Moynahan Welcomes a Baby Boy\". People. 2007-08-23. Retrieved 2008-11-30. ^ Hammel, Sara (2011-02-22). \"Bridget Moynahan Maintains a 'Loving' Family for Son with Ex Tom Brady\". People. Retrieved 2013-03-02. ^ \"Tom Brady & Gisele Bundchen: New Couple?\". People. Archived from the original on September 6, 2015. Retrieved December 7, 2012. ^ \"Patriots Quarterback Tom Brady on Football, Fatherhood, and Gisele B  ndchen\". Archived from the original on 2 October 2013. Retrieved April 27, 2013. ^ Fin, Natalie (2009-03-27). \"It's True. Tom Brady, Gisele B  ndchen Secretly Wed\". E!. Retrieved 2010-09-12. ^ \"Model Tom Brady & Gisele B  ndchen: Married!\". People. 2008-02-27. Retrieved 2009-02-27. ^ Martin, Annie (February 27, 2015). \"Gisele Bundchen shares wedding photo with Tom Brady: The model and NFL star married in two separate ceremonies in 2009\". UPI. Archived from the original on March 10, 2015. Retrieved September 8, 2015. ^ Mikelbank, Peter (2009-12-09). \"Gisele B  ndchen & Tom Brady Have a Boy\". People. Retrieved 2010-01-11. ^ \"Gisele B  ndchen and Tom Brady Name Son Benjamin\". People. December 18, 2009. Archived from the original on March 10, 2010. Retrieved 3 June 2011. ^ \"Gisele B  ndchen Talks to Vogue's Joan Juliet Buck on Having a Baby, Tom Brady and Sejaa\". Vogue. Retrieved 2010-03-15. ^ Leon, Anya; Triggs, Charlotte (December 7, 2012). \"Gisele B  ndchen and Tom Brady Welcome Daughter Vivian Lake\". People. Archived from the original on September 5, 2015. Retrieved December 7, 2012. ^ Lewis, Andy (January 20, 2012). \"Gisele Bundchen and Tom Brady Move Into $20 Million Brentwood Mega-Mansion\". Hollywood Reporter. ^ \"Gisele Bundchen     Gisele Bundchen and Tom Brady buy $14M NYC apartment\". Contactmusic.com. October 25, 2013. Retrieved October 27, 2013. ^ Hanzus, Dan. \"Tom Brady is game for another 'SNL' hosting gig\". National Football League. Retrieved August 17, 2012. ^ Bark, Ed (February 6, 2005). \"Fox gets animated after the Super Bowl\". Dallas Morning News. Retrieved August 17, 2012. ^ \"Patriots News and Notes\". Patriots Insider. Fox Sports. Retrieved August 17, 2012. ^ Farrar, Doug. \"Boston (in) Common: Kevin Youkilis set to marry Tom Brady's sister\". Retrieved February 10, 2012. ^ \"Tom Brady\". Forbes. Retrieved 2015-04-01. ^ \"Peyton Manning vs. Tom Brady Endorsements: Who's No. 1 In Commercial Appeal?\". Retrieved 2015-04-01. ^ Ember, Sydney Tom Brady Still a Key Part of Under Armour's Broader Ad Push New York Times. August 25, 2015   Further reading  Pierce, Charles (2006), Moving the Chains: Tom Brady and the Pursuit of Everything, Farrar, Straus and Giroux, ISBN0-374-21444-1  External links    Wikimedia Commons has media related to Tom Brady.    Tom Brady on Facebook New England Patriots profile Career statistics and player information from NFL.com   ESPN   Yahoo! Sports   SI.com   Pro-Football-Reference   Rotoworld Tom Brady at the Internet Movie Database          v t e   Michigan Wolverines starting quarterbacks          Barmore (1880) Horton (1881) Beach (1882) McNeil (1883   1885) Morrow (1886) Farrand (1887) Smith (1888) Abbott (1889) Holden (1890) Sherman (1891) Sanderson (1892) Greenleaf (1893   1894) Baird (1893   1895) Richards (1895   1897) Drumheller (1896) Felver (1896   1897) Talcott (1898) Street (1899) McGinnis (1900) Weeks (1901   1902) James (1903) Norcross (1904   1905) Barlow (1905) Workman (1906) Wasmund (1907   1909) McMillan (1910   1911) Huebel (1912) Hughitt (1913   1914) Roehm (1915) Sparks (1916, 1919) Weston (1917) Knode (1918) Bank (1920   1921) Uteritz (1921   1923) Rockwell (1924) Friedman (1925   1926) Hoffman (1927) Rich (1928) Simrall (1929) Tessmer (1930   1931) Newman (1930   1932) Fay (1933) Jennings (1934) Renner (1935) Barclay (1936) Farmer (1937) Evashevski (1938   1940) Ceithaml (1941   1942) Wiese (1943) Ponsetto (1944   1945) Yerges (1945   1947) Elliott (1948) Ghindia (1949) Putich (1950) Topor (1951   1952) Baldacci (1953   1954) Maddock (1955) Van Pelt (1956   1957) Ptacek (1958) Noskin (1959) Stamos (1960   1961) Glinka (1960   1961) Timberlake (1962   1964) Gabler (1965) Vidmer (1965   1967) Brown (1967   1968) Moorhead (1969   1970) Slade (1971) Franklin (1972   1974) Leach (1975   1978) Dickey (1979) Wangler (1979   1980) Smith (1981   1983) Zurbrugg (1984) Harbaugh (1984   1986) Brown (1987   1988) Taylor (1987   1989) Grbac (1989   1992) Collins (1993   1994) Dreisbach (1995   1996) Griese (1995   1997) Brady (1998   1999) Henson (2000) Navarre (2000   2003) Henne (2004   2007) Mallett (2007) Sheridan (2008) Threet (2008) Forcier (2009) Robinson (2010   2012) Gardner (2012   2014) Morris (2013   2014) Rudock (2015    )                 v t e   New England Patriots 2000 NFL draft selections          Adrian Klemm J. R. Redmond Greg Randall Dave Stachelski Jeff Marriott Antwan Harris Tom Brady David Nugent Casey Tisdale Patrick Pass                 v t e   New England Patriots current roster       Active roster    3StephenGostkowski 6RyanAllen 10JimmyGaroppolo 11JulianEdelman 12TomBrady 17AaronDobson 18MatthewSlater 19BrandonLaFell 21MalcolmButler 22JustinColeman 23PatrickChung 24RashaanMelvin 26LoganRyan 27TavonWilson 28JamesWhite 29LeGarretteBlount 30DuronHarmon 32DevinMcCourty 33DionLewis 36BrandonKing 37JordanRichards 38BrandonBolden 43NateEbner 49JoeCardona 50RobNinkovich 51JerodMayo 54Dont'aHightower 55JonathanFreeny 58JonBostic 59RufusJohnson 60DavidAndrews 61MarcusCannon 62RyanWendell 63Tre'Jackson 67JoshKline 69ShaqMason 71CameronFleming 72AkiemHicks 76SebastianVollmer 80DannyAmendola 82KeshawnMartin 85MichaelWilliams 87RobGronkowski 88ScottChandler 90MalcomBrown 91JamieCollins 92GeneoGrissom 93JabaalSheard 95ChandlerJones 96SealverSiliga 97AlanBranch 98TreyFlowers 99DominiqueEasley         Reserve lists    13BrandonGibson(IR) 25TarellBrown(IR) 28DarrylRoberts(IR) 36TylerGaffney(IR) 46JamesDevelin(IR) 52DaneFletcher(PUP) 66BryanStork(IR-DFR) 77NateSolder(IR) 84BrianTyms(IR) 86A.J.Derby(IR) 94ChrisJones(PUP)         Practice squad    14ChrisHarper 16AustinHill 31BrandonDixon 44AsanteCleveland 47JoeyIosefa 48DariusFleming 53EricMartin 64ChrisBarker 68BlaineClausell             AFC East BUF MIA NE NYJ North BAL CIN CLE PIT South HOU IND JAX TEN West DEN KC OAK SD   NFC East DAL NYG PHI WAS North CHI DET GB MIN South ATL CAR NO TB West ARI STL SF SEA                  v t e   Current starting quarterbacks in the National Football League (as of Week 7 of the 2015 NFL season)            American Football Conference           AFC East AFC North AFC South AFC West         EJ Manuel (Buffalo Bills) Ryan Tannehill (Miami Dolphins) Tom Brady (New England Patriots) Ryan Fitzpatrick (New York Jets)       Joe Flacco (Baltimore Ravens) Andy Dalton (Cincinnati Bengals) Josh McCown (Cleveland Browns) Landry Jones (Pittsburgh Steelers)       Brian Hoyer (Houston Texans) Andrew Luck (Indianapolis Colts) Blake Bortles (Jacksonville Jaguars) Zach Mettenberger (Tennessee Titans)       Peyton Manning (Denver Broncos) Alex Smith (Kansas City Chiefs) Derek Carr (Oakland Raiders) Philip Rivers (San Diego Chargers)                     National Football Conference           NFC East NFC North NFC South NFC West         Matt Cassel (Dallas Cowboys) Eli Manning (New York Giants) Sam Bradford (Philadelphia Eagles) Kirk Cousins (Washington Redskins)       Jay Cutler (Chicago Bears) Matthew Stafford (Detroit Lions) Aaron Rodgers (Green Bay Packers) Teddy Bridgewater (Minnesota Vikings)       Matt Ryan (Atlanta Falcons) Cam Newton (Carolina Panthers) Drew Brees (New Orleans Saints) Jameis Winston (Tampa Bay Buccaneers)       Carson Palmer (Arizona Cardinals) Colin Kaepernick (San Francisco 49ers) Russell Wilson (Seattle Seahawks) Nick Foles (St. Louis Rams)                      Tom Brady   awards and honors           Awards and achievements   Precededby Peyton Manning Record for NFL Passing Touchdowns in a Single Season 2007 Succeededby Peyton Manning           v t e   1997 Michigan Wolverines football   AP national champions          Jeff Backus Tom Brady David Brandt Mark Campbell Scott Dreisbach Jay Feely Chris Floyd Ian Gold Brian Griese James Hall Tommy Hendricks Chris Howard Steve Hutchinson Jon Jansen Dhani Jones Marcus Knight DeWayne Patmon Marcus Ray Rob Renes Russell Shaw Aaron Shea Glen Steele Tai Streets Sam Sword Anthony Thomas Jerame Tuman Jason Vinson Andre Weathers Clarence Williams Josh Williams Maurice Williams Charles Woodson   Head coach: Lloyd Carr   Assistant coaches: Vance Bedford Erik Campbell Mike DeBord Jim Herrmann Brady Hoke Fred Jackson Terry Malone Stan Parrish                 v t e   New England Patriots Super Bowl XXXVI Champions          4AdamVinatieri 11DrewBledsoe 12TomBrady(MVP) 13KenWalter 14WalterWilliams 15JimmyFarris 16ScottMcCready 19DamonHuard 21J.R.Redmond 22TerranceShaw 23AntwanHarris 24TyLaw 25LeonardMyers 26MattStevens 27TerrellBuckley 28BrockWilliams 29HakimAkbar 30JerodCherry 31BenKelly 32AntowainSmith 33KevinFaulk 34TebuckyJones 35PatrickPass 36LawyerMilloy 38RayHill 44MarcEdwards 45OtisSmith 48ArtherLove 49JabariHolloway 50MikeVrabel 51BryanCox 52TedJohnson 53LarryIzzo 54TedyBruschi 55WillieMcGinest 58MattChatham 59AndyKatzenmoyer 60DrewInzer 61StephenNeal 62SetemaGali 63JoeAndruzzi 64GregRandall 65DamienWoody 66LoniePaxton 67GreyRuegamer 68TomAshworth 70AdrianKlemm 71ChrisSullivan 72MattLight 74KenyattaJones 75MauriceAnderson 76GrantWilliams 77MikeCompton 80TroyBrown 81CharlesJohnson 82CurtisJackson 83RodRutledge 84FredColeman 85JermaineWiggins 86DavidPatten 88TerryGlenn 90MartyMoore 91BobbyHamilton 92DavidNugent 93RichardSeymour 94JaceSayler 95RomanPhifer 96BrandonMitchell 97RiddickParker 98AnthonyPleasant 99KoleAyi HeadCoach:BillBelichick Coaches:NedBurke RomeoCrennel BrianDaboll JeffDavidson IvanFears PepperJohnson EricMangini RandyMelvin MarkusPaul RobRyan DanteScarnecchia BradSeely CharlieWeis MikeWoicik                 v t e   New England Patriots Super Bowl XXXVIII Champions          4AdamVinatieri 6RohanDavey 10JaminElliott 12TomBrady(MVP) 13KenWalter 16KliffKingsbury 17DedricWard 18ChasGessner 19DamonHuard 21MikeCloud 22AsanteSamuel 23AntwanHarris 24TyLaw 26EugeneWilson 30Je'RodCherry 31LarryCenters 32AntowainSmith 33KevinFaulk 34ChrisAkins 35PatrickPass 37RodneyHarrison 38TyronePoole 39ShawnMayer 44FredMcCrary 46BrianKinchen 48TullyBanta-Cain 49SeanMcDermott 50MikeVrabel 51DonDavis 52TedJohnson 53LarryIzzo 54TedyBruschi 55WillieMcGinest 58MattChatham 59RoseveltColvin 60WilbertBrown 61StephenNeal 62TimProvost 63JoeAndruzzi 64GeneMruczkowski 65DamienWoody 66LoniePaxton 67DanKoppen 68TomAshworth 70AdrianKlemm 71RussHochstein 72MattLight 75JamilSoriano 76BrandonGorin 77MikeCompton 80TroyBrown 81BethelJohnson 82DanielGraham 83DeionBranch 84FredBaxter 85J.J.Stokes 86DavidPatten 87DavidGivens 88ChristianFauria 90DanKlecko 91BobbyHamilton 92TedWashington 93RichardSeymour 94TyWarren 95RomanPhifer 96RickLyle 97JarvisGreen 98AnthonyPleasant 99EthanKelley HeadCoach:BillBelichick Coaches:RomeoCrennel BrianDaboll JeffDavidson IvanFears SeanGustus JohnHufnagel PepperJohnson JoshMcDaniels EricMangini MarkusPaul RobRyan DanteScarnecchia BradSeely CharlieWeis MikeWoicik                 v t e   New England Patriots Super Bowl XXXIX Champions          4AdamVinatieri 6RohanDavey 8JoshMiller 10KevinKasper 12TomBrady 13JimMiller 14P.K.Sam 18CedricJames 19RickyBryant 21RandallGay 22AsanteSamuel 23OmareLowe 24TyLaw 26EugeneWilson 27RabihAbdullah 28CoreyDillon 29EarthwindMoreland 30Je'RodCherry 31HankPoteat 32KoryChapman 33KevinFaulk 34CedricCobbs 35PatrickPass 37RodneyHarrison 38TyronePoole 39GussScott 42DexterReid 46ZeronFlemister 47JustinKurpeikis 48TullyBanta-Cain 49EricAlexander 50MikeVrabel 51DonDavis 52TedJohnson 53LarryIzzo 54TedyBruschi 55WillieMcGinest 58MattChatham 59RoseveltColvin 61StephenNeal 63JoeAndruzzi 64GeneMruczkowski 65LanceNimmo 66LoniePaxton 67DanKoppen 68TomAshworth 69BuckRasmussen 70AdrianKlemm 71RussHochstein 72MattLight 74BillyYates 75VinceWilfork 76BrandonGorin 80TroyBrown 81BethelJohnson 82DanielGraham 83DeionBranch(MVP) 84BenjaminWatson 85JedWeaver 86DavidPatten 87DavidGivens 88ChristianFauria 90DanKlecko 91MarquiseHill 93RichardSeymour 94TyWarren 95RomanPhifer 96RodneyBailey 97JarvisGreen 98KeithTraylor 99EthanKelley HeadCoach:BillBelichick Coaches:RomeoCrennel BrianDaboll JeffDavidson IvanFears PepperJohnson JoshMcDaniels EricMangini MattPatricia MarkusPaul DeanPees DanteScarnecchia BradSeely CoryUndlin CharlieWeis MikeWoicik                 v t e   New England Patriots Super Bowl XLIX Champions          3StephenGostkowski 6RyanAllen 8GarrettGilbert 10JimmyGaroppolo 11JulianEdelman 12TomBrady(MVP) 16JonathanKrause 17AaronDobson 18MatthewSlater 19BrandonLaFell 21MalcolmButler 22StevanRidley 23PatrickChung 24DarrelleRevis 25KyleArrington 26LoganRyan 27TavonWilson 28JamesWhite 29LeGarretteBlount 30DuronHarmon 31JustinGreen 32DevinMcCourty 34ShaneVereen 35JonasGray 37AlfonzoDennard 38BrandonBolden 39BrandonBrowner 41DaxtonSwanson 43NateEbner 44DeontaeSkinner 45CameronGordon 46JamesDevelin 47MichaelHoomanawanui 48DannyAiken 50RobNinkovich 51JerodMayo 52JonathanCasillas 53EricMartin 54Dont'aHightower 55AkeemAyers 58DariusFleming 59ChrisWhite 61MarcusCannon 62RyanWendell 63DanConnolly 64ChrisBarker 65JordanDevey 66BryanStork 67JoshKline 68CaylinHauptmann 71CameronFleming 72JoeVellano 74DominiqueEasley 75VinceWilfork 76SebastianVollmer 77NateSolder 80DannyAmendola 81TimWright 82JoshBoyce 84BrianTyms 87RobGronkowski 90ZachMoore 91JamieCollins 92JakeBequette 94ChrisJones 95ChandlerJones 96SealverSiliga 97AlanBranch 99MichaelBuchanan HeadCoach:BillBelichick Coaches:JoshBoyer BrianDaboll BrendanDaly DaveDeGuglielmo IvanFears BrianFlores PatrickGraham JoshMcDaniels HaroldNash ScottO'Brien ChadO'Shea MattPatricia                 v t e   National Football League | NFL's 2000s All-Decade Team          Tom Brady Peyton Manning LaDainian Tomlinson Edgerrin James Jamal Lewis Shaun Alexander Lorenzo Neal Tony Richardson Randy Moss Marvin Harrison Terrell Owens Torry Holt Tony Gonzalez Antonio Gates Walter Jones Jonathan Ogden Orlando Pace Willie Roaf Alan Faneca Steve Hutchinson Will Shields Larry Allen Kevin Mawae Olin Kreutz Dwight Freeney Michael Strahan Jason Taylor Julius Peppers Richard Seymour Warren Sapp Kevin Williams La'Roi Glover Ray Lewis Derrick Brooks Brian Urlacher Joey Porter Zach Thomas DeMarcus Ware Champ Bailey Charles Woodson Ty Law Ronde Barber Ed Reed Brian Dawkins Troy Polamalu Darren Sharper Adam Vinatieri David Akers Shane Lechler Brian Moorman Josh Cribbs Dante Hall Devin Hester Bill Belichick Tony Dungy                 v t e   Super Bowl MVP Award          I:Starr II:Starr III:Namath IV:Dawson V:Howley VI:Staubach VII:Scott VIII:Csonka IX:Harris X:Swann XI:Biletnikoff XII:Martin&White XIII:Bradshaw XIV:Bradshaw XV:Plunkett XVI:Montana XVII:Riggins XVIII:Allen XIX:Montana XX:Dent XXI:Simms XXII:Williams XXIII:Rice XXIV:Montana XXV:Anderson XXVI:Rypien XXVII:Aikman XXVIII:E.Smith XXIX:Young XXX:Brown XXXI:Howard XXXII:Davis XXXIII:Elway XXXIV:Warner XXXV:Lewis XXXVI:Brady XXXVII:Jackson XXXVIII:Brady XXXIX:Branch XL:Ward XLI:P.Manning XLII:E.Manning XLIII:Holmes XLIV:Brees XLV:Rodgers XLVI:E.Manning XLVII:Flacco XLVIII:M.Smith XLIX:Brady                 v t e   Super Bowl champion starting quarterbacks          I:Starr II:Starr III:Namath IV:Dawson V:Unitas VI:Staubach VII:Griese VIII:Griese IX:Bradshaw X:Bradshaw XI:Stabler XII:Staubach XIII:Bradshaw XIV:Bradshaw XV:Plunkett XVI:Montana XVII:Theismann XVIII:Plunkett XIX:Montana XX:McMahon XXI:Simms XXII:Williams XXIII:Montana XXIV:Montana XXV:Hostetler XXVI:Rypien XXVII:Aikman XXVIII:Aikman XXIX:Young XXX:Aikman XXXI:Favre XXXII:Elway XXXIII:Elway XXXIV:Warner XXXV:Dilfer XXXVI:Brady XXXVII:Johnson XXXVIII:Brady XXXIX:Brady XL:Roethlisberger XLI:P.Manning XLII:E.Manning XLIII:Roethlisberger XLIV:Brees XLV:Rodgers XLVI:E.Manning XLVII:Flacco XLVIII:Wilson XLIX:Brady                 v t e   NFL quarterbacks with a perfect passer rating game          Ray Mallouf Sammy Baugh Len Dawson Y. A. Tittle Frank Ryan Sonny Jurgensen Joe Namath Johnny Unitas Don Meredith Craig Morton (2) Fran Tarkenton Daryle Lamonica Dick Shiner Bob Lee James Harris Ken Anderson Jim Hart Dan Fouts Scott Hunter Terry Bradshaw Steve Grogan Brian Sipe Bob Griese Vince Evans Dave Krieg (2) Steve Bartkowski Ken O'Brien (2) Steve Young Joe Montana Rich Gannon Bobby Hebert Mick Buck Drew Bledsoe Craig Erickson Chris Chandler Jeff Blake Kurt Warner (3) Peyton Manning (4) Doug Flutie Kerry Collins Chad Pennington Trent Green Ben Roethlisberger (3) Donovan McNabb Tom Brady (2) Eli Manning Drew Brees Robert Griffin III Nick Foles Alex Smith Geno Smith Marcus Mariota Ryan Tannehill  Names in bold are still active                v t e   NFL MVP Award from the Associated Press          1957:J.Brown 1958:J.Brown 1959:Unitas 1960:Notawarded 1961:Hornung 1962:J.Taylor 1963:Tittle 1964:Unitas 1965:J.Brown 1966:Starr 1967:Unitas 1968:Morrall 1969:Gabriel 1970:Brodie 1971:Page 1972:L.Brown 1973:Simpson 1974:Stabler 1975:Tarkenton1976:Jones 1977:Payton 1978:Bradshaw 1979:Campbell 1980:Sipe 1981:Anderson 1982:Moseley 1983:Theismann 1984:Marino 1985:Allen 1986:L.Taylor 1987:Elway 1988:Esiason 1989:Montana 1990:Montana 1991:Thomas 1992:Young 1993:Smith 1994:Young 1995:Favre 1996:Favre 1997:Favre&Sanders 1998:Davis 1999:Warner 2000:Faulk 2001:Warner 2002:Gannon 2003:Manning&McNair 2004:Manning 2005:Alexander 2006:Tomlinson 2007:Brady 2008:Manning 2009:Manning 2010:Brady 2011:Rodgers 2012:Peterson 2013:Manning 2014:Rodgers                 v t e   NFL Offensive Player of the Year Award from the Associated Press          1972:Brown 1973:Simpson 1974:Stabler 1975:Tarkenton 1976:Jones 1977:Payton 1978:Campbell 1979:Campbell 1980:Campbell 1981:Anderson 1982:Fouts 1983:Theismann 1984:Marino 1985:Allen 1986:Dickerson 1987:Rice 1988:Craig 1989:Montana 1990:Moon 1991:Thomas 1992:Young 1993:Rice 1994:Sanders 1995:Favre 1996:Davis 1997:Sanders 1998:Davis 1999:Faulk 2000:Faulk 2001:Faulk 2002:Holmes 2003:Lewis 2004:Manning 2005:Alexander 2006:Tomlinson 2007:Brady 2008:Brees 2009:Johnson 2010:Brady 2011:Brees 2012:Peterson 2013:Manning 2014:Murray                 v t e   2007 AP NFL All-Pro Team          Offense:QBTomBrady RBLaDainianTomlinson RBBrianWestbrook FBLorenzoNeal WRRandyMoss WRTerrellOwens TEJasonWitten OTMattLight OTWalterJones GAlanFaneca GSteveHutchinson CJeffSaturday Defense:DEJaredAllen DEPatrickKerney DTAlbertHaynesworth DTKevinWilliams OLBMikeVrabel OLBDeMarcusWare ILBLofaTatupu ILBPatrickWillis CBAntonioCromartie CBAsanteSamuel FSEdReed SSBobSanders SpecialTeams:PAndyLee PKRobBironas KRDevinHester                 v t e   2010 AP NFL All-Pro Team          Offense:QBTomBrady RBArianFoster RBJamaalCharles FBVontaLeach WRRoddyWhite WRReggieWayne TEJasonWitten OTJoeThomas OTJakeLong GJahriEvans GLoganMankins CNickMangold Defense:DEJuliusPeppers DEJohnAbraham DTHalotiNgata DTNdamukongSuh OLBClayMatthews OLBJamesHarrison ILBJerodMayo ILBPatrickWillis CBDarrelleRevis CBNnamdiAsomugha FSEdReed SSTroyPolamalu SpecialTeams:PShaneLechler PKBillyCundiff KRDevinHester                 v t e   Bert Bell Award winners          1959:Unitas 1960:VanBrocklin 1961:Hornung 1962:Robustelli 1963:J.Brown 1964:Unitas 1965:Retzlaff 1966:Meredith 1967:Unitas 1968:Kelly 1969:Gabriel 1970:Blanda 1971:Staubach 1972:L.Brown 1973:Simpson 1974:Olsen 1975:Tarkenton 1976:Stabler 1977:Griese 1978:Bradshaw 1979:Campbell 1980:Jaworski 1981:Anderson 1982:Theismann 1983:Riggins 1984:Marino 1985:Payton 1986:Taylor 1987:Rice 1988:Cunningham 1989:Montana 1990:Cunningham 1991:Sanders 1992:Young 1993:Smith 1994:Young 1995:Favre 1996:Favre 1997:Sanders 1998:Cunningham 1999:Warner 2000:Gannon 2001:Faulk 2002:Gannon 2003:Manning 2004:Manning 2005:Alexander 2006:Tomlinson 2007:Brady 2008:Peterson 2009:Brees 2010:Vick 2011:Rodgers 2012:Peterson 2013:Manning 2014:Watt                 v t e   Associated Press Male Athlete of the Year          1931: Pepper Martin 1932: Gene Sarazen 1933: Carl Hubbell 1934: Dizzy Dean 1935: Joe Louis 1936: Jesse Owens 1937: Don Budge 1938: Don Budge 1939: Nile Kinnick 1940: Tom Harmon 1941: Joe DiMaggio 1942: Frank Sinkwich 1943: Gunder H  gg 1944: Byron Nelson 1945: Byron Nelson 1946: Glenn Davis 1947: Johnny Lujack 1948: Lou Boudreau 1949: Leon Hart 1950: Jim Konstanty 1951: Dick Kazmaier 1952: Bob Mathias 1953: Ben Hogan 1954: Willie Mays 1955: Howard Cassady 1956: Mickey Mantle 1957: Ted Williams 1958: Herb Elliot 1959: Ingemar Johansson 1960: Rafer Johnson 1961: Roger Maris 1962: Maury Wills 1963: Sandy Koufax 1964: Don Schollander 1965: Sandy Koufax 1966: Frank Robinson 1967: Carl Yastrzemski 1968: Denny McLain 1969: Tom Seaver 1970: George Blanda 1971: Lee Trevino 1972: Mark Spitz 1973: O. J. Simpson 1974: Muhammad Ali 1975: Fred Lynn 1976: Bruce Jenner 1977: Steve Cauthen 1978: Ron Guidry 1979: Willie Stargell 1980: U.S. Olympic Hockey Team 1981: John McEnroe 1982: Wayne Gretzky 1983: Carl Lewis 1984: Carl Lewis 1985: Dwight Gooden 1986: Larry Bird 1987: Ben Johnson 1988: Orel Hershiser 1989: Joe Montana 1990: Joe Montana 1991: Michael Jordan 1992: Michael Jordan 1993: Michael Jordan 1994: George Foreman 1995: Cal Ripken, Jr. 1996: Michael Johnson 1997: Tiger Woods 1998: Mark McGwire 1999: Tiger Woods 2000: Tiger Woods 2001: Barry Bonds 2002: Lance Armstrong 2003: Lance Armstrong 2004: Lance Armstrong 2005: Lance Armstrong 2006: Tiger Woods 2007: Tom Brady 2008: Michael Phelps 2009: Jimmie Johnson 2010: Drew Brees 2011: Aaron Rodgers 2012: Michael Phelps 2013: LeBron James 2014: Madison Bumgarner                 v t e   Sports Illustrated Sportsman of the Year          1954: Roger Bannister 1955: Johnny Podres 1956: Bobby Morrow 1957: Stan Musial 1958: Rafer Johnson 1959: Ingemar Johansson 1960: Arnold Palmer 1961: Jerry Lucas 1962: Terry Baker 1963: Pete Rozelle 1964: Ken Venturi 1965: Sandy Koufax 1966: Jim Ryun 1967: Carl Yastrzemski 1968: Bill Russell 1969: Tom Seaver 1970: Bobby Orr 1971: Lee Trevino 1972: Billie Jean King & John Wooden 1973: Jackie Stewart 1974: Muhammad Ali 1975: Pete Rose 1976: Chris Evert 1977: Steve Cauthen 1978: Jack Nicklaus 1979: Terry Bradshaw & Willie Stargell 1980: U.S. Olympic Hockey Team 1981: Sugar Ray Leonard 1982: Wayne Gretzky 1983: Mary Decker 1984: Edwin Moses & Mary Lou Retton 1985: Kareem Abdul-Jabbar 1986: Joe Paterno 1987: Bob Bourne, Judi Brown King, Kipchoge Keino, Dale Murphy, Chip Rives, Patty Sheehan, Rory Sparrow, & Reggie Williams 1988: Orel Hershiser 1989: Greg LeMond 1990: Joe Montana 1991: Michael Jordan 1992: Arthur Ashe 1993: Don Shula 1994: Bonnie Blair & Johann Olav Koss 1995: Cal Ripken, Jr. 1996: Tiger Woods 1997: Dean Smith 1998: Mark McGwire & Sammy Sosa 1999: U.S. Women's Soccer Team 2000: Tiger Woods 2001: Curt Schilling & Randy Johnson 2002: Lance Armstrong 2003: David Robinson & Tim Duncan 2004: Boston Red Sox 2005: Tom Brady 2006: Dwyane Wade 2007: Brett Favre 2008: Michael Phelps 2009: Derek Jeter 2010: Drew Brees 2011: Mike Krzyzewski & Pat Summitt 2012: LeBron James 2013: Peyton Manning 2014: Madison Bumgarner                 v t e   Sporting News Sportsman/Pro Athlete of the Year          1968: Denny McLain 1969: Tom Seaver 1970: John Wooden 1971: Lee Trevino 1972: Charlie Finley 1973: O. J. Simpson 1974: Lou Brock 1975: Archie Griffin 1976: Larry O'Brien 1977: Steve Cauthen 1978: Ron Guidry 1979: Willie Stargell 1980: George Brett 1981: Wayne Gretzky 1982: Whitey Herzog 1983: Bowie Kuhn 1984: Peter Ueberroth 1985: Pete Rose 1986: Larry Bird 1987: None 1988: Jackie Joyner-Kersee 1989: Joe Montana 1990: Nolan Ryan 1991: Michael Jordan 1992: Mike Krzyzewski 1993: Cito Gaston & Pat Gillick 1994: Emmitt Smith 1995: Cal Ripken, Jr. 1996: Joe Torre 1997: Mark McGwire 1998: Mark McGwire & Sammy Sosa 1999: New York Yankees 2000: Marshall Faulk & Kurt Warner 2001: Curt Schilling 2002: Tyrone Willingham 2003: Dick Vermeil & Jack McKeon 2004: Tom Brady 2005: Matt Leinart 2006: Dwyane Wade 2007: Tom Brady 2008: Eli Manning 2009: Mariano Rivera 2010: Roy Halladay 2011: Aaron Rodgers 2012: LeBron James                 v t e   PFW/PFWA NFL Comeback Player of the Year Award          1972:Morrall 1973:Gabriel 1974:Namath 1975:Hampton 1976:Landry 1977:Morton 1978:Riggins 1979:Csonka 1980:Plunkett 1981:Anderson 1982:Alzado 1983:B.Johnson 1984:Stallworth 1985:NoSelection 1986:Montana&Kramer 1987:White 1988:Bell 1989:Anderson 1990:Word 1991:McMahon 1992:Cunningham 1993:Allen 1994:Marino 1995:Harbaugh 1996:Bettis 1997:Brooks 1998:Flutie 1999:Young 2000:J.Johnson 2001:Hearst 2002:Maddox 2003:Kitna 2004:McGahee 2005:Smith 2006:Pennington 2007:Moss 2008:Pennington 2009:Brady 2010:Vick 2011:Stafford 2012:Peterson 2013:Rivers 2014:Gronkowski                 v t e   NFL Top 100       #1 Players    2011: Brady 2012: Rodgers 2013: Peterson 2014: Manning 2015: Watt         Lists    2011 2012 2013 2014 2015         Related    NFL Network Lindsay Rhodes                 v t e   New England Patriots 50th Anniversary Team (2009)          Offense Brady (QB) Nance (RB) Cunningham (RB) Morgan (WR) Brown (WR) Fryar (WR) Coates (TE) Armstrong (T) Light (T) Hannah (G) Mankins (G) Morris (C)   Defense Adams (DE) Seymour (DE) Antwine (DT) Wilfork (DT) Tippett (OLB) Vrabel (OLB) Nelson (ILB) Buoniconti (ILB) Haynes (CB) Law (CB) Marion (S) Harrison (S)   Special Teams Faulk (Ret.) Vinatieri (PK) Camarillo (P) Tatupu (ST)   Captains Cappelletti (Offense) Bruschi (Defense)   Coach Belichick                 v t e   New England Patriots All-2000s Team          Offense Brady (QB) Dillon (RB) Moss (WR) Welker (WR) Brown (WR) Graham (TE) Light (T) Kaczur (T) Andruzzi (G) Mankins (G) Koppen (C)   Defense Seymour (DE) Warren (DE) Wilfork (NT) McGinest (OLB) Vrabel (OLB) Bruschi (ILB) Phifer (ILB) Law (CB) Samuel (CB) Harrison (S) Milloy (S)   Special Teams Faulk (Ret.) Vinatieri (PK) Miller (P) Izzo (ST)   Coach Belichick                 v t e   NFL season passing touchdown leaders          1932: Herber 1933: Newman 1934: Herber 1935: Danowski 1936: Herber 1937: Masterson 1938: Monnett 1939: Filchock 1940: Baugh 1941: Isbell 1942: Isbell 1943: Luckman 1944: Filchock 1945: Luckman & Waterfield 1946: Luckman & Waterfield 1947: Baugh 1948: Thompson 1949: Lujack 1950: Ratterman 1951: Layne 1952: Finks & Graham 1953: Thomason 1954: Burk 1955: Tittle & Rote 1956: Rote 1957: Unitas 1958: Unitas 1959: Unitas 1960: Unitas 1961: Jurgensen 1962: Tittle 1963: Tittle 1964: Ryan 1965: Brodie 1966: Ryan 1967: Jurgensen 1968: Morrall 1969: Gabriel 1970: Brodie 1971: Hadl 1972: Kilmer & Namath 1973: Gabriel & Staubach 1974: Stabler 1975: Tarkenton & Ferguson 1976: Stabler 1977: Griese 1978: Bradshaw 1979: Grogan & Sipe 1980: Bartkowski 1981: Fouts 1982: Fouts, Bradshaw, Montana 1983: Dickey 1984: Marino 1985: Marino 1986: Marino 1987: Montana 1988: Everett 1989: Everett 1990: Moon 1991: Kelly 1992: Young 1993: Young 1994: Young 1995: Favre 1996: Favre 1997: Favre 1998: Young 1999: Warner 2000: Manning & Culpepper 2001: Warner 2002: Brady 2003: Favre 2004: Manning 2005: Palmer 2006: Manning 2007: Brady 2008: Brees & Rivers 2009: Brees 2010: Brady 2011: Brees 2012: Brees 2013: Manning 2014: Luck                 v t e   NFL season passing yards leaders          1932: Herber 1933: Newman 1934: Herber 1935: Danowski 1936: Herber 1937: Baugh 1938: Parker 1939: O'Brien 1940: Baugh 1941: Isbell 1942: Isbell 1943: Luckman 1944: Comp 1945: Luckman 1946: Luckman 1947: Baugh 1948: Baugh 1949: Lujack 1950: Layne 1951: Layne 1952: Graham 1953: Graham 1954: Van Brocklin 1955: Finks 1956: Rote 1957: Unitas 1958: Wade 1959: Unitas 1960: Unitas 1961: Jurgensen 1962: Jurgensen 1963: Unitas 1964: Johnson 1965: Brodie 1966: Jurgensen 1967: Jurgensen 1968: Brodie 1969: Jurgensen 1970: Brodie 1971: Hadl 1972: Namath 1973: Gabriel 1974: Anderson 1975: Anderson 1976: Jones 1977: Ferguson 1978: Tarkenton 1979: Fouts 1980: Fouts 1981: Fouts 1982: Fouts 1983: Dickey 1984: Marino 1985: Marino 1986: Marino 1987: Lomax 1988: Marino 1989: Majkowski 1990: Moon 1991: Moon 1992: Marino 1993: Elway 1994: Bledsoe 1995: Favre 1996: Brunell 1997: George 1998: Favre 1999: Beuerlein 2000: Manning 2001: Warner 2002: Gannon 2003: Manning 2004: Culpepper 2005: Brady 2006: Brees 2007: Brady 2008: Brees 2009: Schaub 2010: Rivers 2011: Brees 2012: Brees 2013: Manning 2014: Brees & Roethlisberger                 v t e   Boston / New England Patriots starting quarterbacks          ButchSongin(1960   1961) TomGreene(1960) BabeParilli(1961   1967) TomYewcic(1962) EddieWilson(1965) DonTrull(1967) MikeTaliaferro(1968   1970) TomSherman(1968) JoeKapp(1970) JimPlunkett(1971   1975) SteveGrogan(1975   1990) NeilGraff(1975) MattCavanaugh(1980   1982) TomOwen(1981) TonyEason(1983   1989) TomRamsey(1987   1988) BobBleier(1987) DougFlutie(1987   1989) MarcWilson(1989   1990) TommyHodson(1990   1992) HughMillen(1991   1992) ScottZolak(1992   1998) JeffCarlson(1992) ScottSecules(1993) DrewBledsoe(1993   2001) TomBrady(2001   present) MattCassel(2008)                     Authority control    WorldCat VIAF: 48590636 LCCN: n2002091647           NewPP limit report Parsed by mw1117 Cached time: 20151026001503 Cache expiry: 3600 Dynamic content: true CPU time usage: 4.114 seconds Real time usage: 4.460 seconds Preprocessor visited node count: 13259/1000000 Preprocessor generated node count: 0/1500000 Post   expand include size: 780971/2097152 bytes Template argument size: 201708/2097152 bytes Highest expansion depth: 15/40 Expensive parser function count: 6/500 Lua time usage: 1.642/10.000 seconds Lua memory usage: 8.92 MB/50 MB Number of Wikibase entities loaded: 1   Transclusion expansion time report (%,ms,calls,template) 100.00% 3286.541      1 - -total  37.12% 1220.080      1 - Template:Reflist  19.63%  645.279      1 - Template:Navboxes  17.18%  564.742     92 - Template:Cite_web  15.32%  503.344      4 - Template:Infobox  14.36%  471.834     14 - Template:Team_roster_navbox  13.76%  452.262      1 - Template:Infobox_NFL_player  10.16%  333.929     57 - Template:Cite_news   7.27%  238.902     16 - Template:Navbox   3.90%  128.252      1 - Template:New_England_Patriots_roster_navbox   Saved in parser cache with key enwiki:pcache:idhash:339841-0!*!0!!en!4!* and timestamp 20151026001505 and revision id 687503065    Saved in parser cache with key enwiki:stable-pcache:idhash:339841-0!*!0!!en!4!* and timestamp 20151026001507 and revision id 687503065           Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tom_Brady&oldid=687503065\"      Categories: 1977 birthsLiving peopleAmerican football quarterbacksMichigan Wolverines football playersNew England Patriots playersAmerican Conference Pro Bowl playersSuper Bowl championsSuper Bowl MVPsMerrill Lynch peoplePeople from San Mateo, CaliforniaPlayers of American football from CaliforniaSportspeople from the San Francisco Bay AreaAmerican people of Irish descentAmerican Roman CatholicsHidden categories: Wikipedia pending changes protected pages (level 1)Wikipedia protected pages without expiryNew England Patriots currentteam parameter articlesAll articles with unsourced statementsArticles with unsourced statements from November 2014Vague or ambiguous time from January 2015Commons category with local link same as on WikidataWikipedia articles with VIAF identifiersWikipedia articles with LCCN identifiers     Navigation menu   Personal tools  Create accountLog in     Namespaces  Article Talk     Variants          Views  Read View source View history    More        Search             Navigation   Main pageContentsFeatured contentCurrent eventsRandom articleDonate to WikipediaWikipedia store     Interaction   HelpAbout WikipediaCommunity portalRecent changesContact page     Tools   What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationWikidata itemCite this page     Print/export   Create a bookDownload as PDFPrintable version     Languages     e  tinaDanskDeutschEestiEspa  ol Fran  aisGaeilgeGalego Italiano Latvie  uMagyarMalagasyNederlands Norsk bokm  lPolskiPortugu  s Simple English             / srpskiSuomiSvenskaT  rk  eWinaray   Edit links        This page was last modified on 26 October 2015, at 00:15. Text is available under the Creative Commons Attribution-ShareAlike License; additional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia   is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.   Privacy policy About Wikipedia Disclaimers Contact Wikipedia Developers Mobile view                "}]